{"id":1,"text":"Work experience June 2014 - Present TOPCV JSC Currently, I am still studying at school and have not participated in an internship in any company. About specialized knowledge, I have mastered the programming languages as ​C, C++ and Python. About Artificial Intelligence already have basic knowledge of machine learning, computer vision and natural language processing. I can use quite well the libraries in python like OpenCV, Pandas, Tensorflow , Pytorch.","label":[[16,35,"TIME"],[36,46,"ORG"]]}
{"id":2,"text":"Education TRƯỜNG ĐẠI HỌC CÔNG NGHỆ 2019 - 2022 THÔNGTIN- ĐHQGHCM Major: Computer Science GPA: 7,2 . Now i'm studying 3rd year university.","label":[[10,34,"ORG"],[35,46,"TIME"],[72,89,"MAJOR"],[94,97,"SCORE"]]}
{"id":3,"text":"WORKING EXPERIENCE BIZ4 TECHNOLOGY CO., LTD APRIL 2019 – AUGUST 2019 Using the Xamarin technology of the C# language together with the .Net framework to create a short or long term time and schedule management application. The next project deploys the company's internal employee management application, including features such as time attendance, approval application, progress reporting, division of work of each department, etc., developed on the Android platform. FPT SOFTWARE CO., LTD SEPTEMBER 2019 – NOVEMBER 2019 INTERSHIP Lasting 2 months internship at the Company, of which 1 month used SQLite and Java, and trained in both HTML5 and CSS3. The remaining month is applied to make an actual software and web to book tourist bus tickets (for customers) and control empty or already scheduled cars, prices, maintenance (for travel agencies). BSP 3 MEMBERS LIMITED COMPANY DECEMBER 2019 – MARCH 2020 The first month will be working on an app like Tinder that can like or dislike the people you choose. The data is fetched and will be saved on Firebase. In 2 months, I will work on a Japanese learning application like Mazzi dictionary based on the available Database. FPT INFORMATION SYSTEM CO., LTD AUGUST 2020 – JANUARY 2021 The first month will work on an application called Attendance Training to manage attendance, create permission applications and other utilities for employees with Navigate. Also learn about Redux including API and Redux Saga. In the next 2 months, adding and maintaining an online learning and exam application called eLearning integrated into the application of Training Attendance based on the above knowledge and practical application.","label":[[19,43,"ORG"],[44,68,"TIME"],[468,489,"ORG"],[490,520,"TIME"],[521,530,"POSITION"],[848,877,"ORG"],[878,904,"TIME"],[1173,1204,"ORG"],[1205,1231,"TIME"]]}
{"id":4,"text":"EDUCATION University of Information Technology-VNU HCM 2018 Bachelor in Data Scinece Four year Nguyen Binh Khiem High School for the gifted 2015-2018 Information Technology","label":[[10,54,"ORG"],[55,59,"TIME"],[60,68,"DEGREE"],[72,84,"MAJOR"],[95,124,"ORG"],[140,149,"TIME"],[150,172,"MAJOR"]]}
{"id":5,"text":"Education: Hanoi University of Science and Technology (HUST) September 2017 – Present ● Focus on AI, Controller and Automation. ● Fourth year student. VietAI December 2018 – February 2019 ● Basic understanding of Machine Learning and Deep Learning. ● Completed practical assignments: Vehicle Classification , Fashion Classification, YOLO.","label":[[11,60,"ORG"],[61,85,"TIME"],[151,157,"ORG"],[158,187,"TIME"]]}
{"id":6,"text":"Experiences: Research Assistant - Mandevices Lab, HUST September 2020 – Present ● Predict rain status based on measuring temperature and humidity on Zigbee media. ● Develop a member attendance system using Raspberry Pi 3. Internship - Viettel High Technology Industries March 2020 – February 2021 Worked with Computer Vision Algorithm team ● Research about Binocular and Monocular, apply these in the field of Reconstruction 3D. ● Research, improve the disadvantages of Ultralight 1MB model for face-mask detection. ● Research about Pruning for Violence Recognition. Research Assistant - HPC-Lab, HUST February 2018 – July 2018 ● A research laboratory specializing in Artificial Intelligence and Block-chain. ● Trained and worked on Linear Regression, PLA Softmax, CNN.","label":[[13,32,"POSITION"],[34,54,"ORG"],[55,79,"TIME"],[222,232,"POSITION"],[235,269,"ORG"],[270,296,"TIME"],[567,585,"POSITION"],[588,601,"ORG"],[602,627,"TIME"]]}
{"id":7,"text":"EDUCATION Ho Chi Minh VNU HCMUS - University of Science 2020 - 2024 Bachelor of Science in Computer Science. • • Courseworks: Introduction to programming, technical programming, data structure and algorithm, discrete mathematics, calculus, linear algebra, probability, machine learning (Andrew Ng). Cum. GPA: 3.5 \/ 4.0 • Major. GPA: 3.5 \/ 4.0. • Vung Tau Nguyen Du Highschool 2017 - 2020 Top 1 gifted student in grade 10 2017 – 2018 • • Bronze Medal at the Vung Tau Provincial Physics Olympiad Consolation prize at the Vung Tau Provincial Physics Olympiad 2017 – 2018 2018 2019 • –","label":[[10,55,"ORG"],[56,67,"TIME"],[68,77,"DEGREE"],[91,107,"MAJOR"],[309,318,"SCORE"],[333,342,"SCORE"],[346,375,"ORG"],[376,387,"TIME"],[421,432,"TIME"],[556,567,"TIME"],[568,577,"TIME"]]}
{"id":8,"text":"Experience VinBrain - Vingroup May. 2021 – Present Applied Scientist • Participate in AI development projects for medical segmentation, medical diagnostic and surveillance camera - Smart City - Smart Homes 3D MRI Image CT-Rectal Tumor Segmentation ∗ Proposed and develop a model built upon encoder-decoder architecture, exploiting transformer with the Ki-Unet branch to the network to recon-struct the input images jointly with segmentation. ∗ Analysis, processing and visualization the datasets ∗ Support and collaborate with the web backend development team to deploy the trained AI model to the cloud server and Edge Device ∗ Framework: Pytorch, OpenCV Liver Vessel Segmentation ∗ Propose an effective Dual consistency assisted multi-confident learning for hepatic vessels segmentation ∗ Conduct the experiments for the proposed method and the existing methods ∗ Write a scientific paper to submit to a conference ∗ Analysis, processing and visualization the datasets ∗ Framework: Pytorch, OpenCV Pet detection on surveillance camera - SmartHome (VinHomes’s Project) ∗ Develop a Yolov5 model to detection Pet ∗ In the product phase, build a process that includes collecting, labeling the data collected from the camera, and retraining the model ∗ Optimize model, hyperparameter, pipeline and logic rule ∗ Support and collaborate with the Engineer backend development team to deloy the trained AI model to the cloud server and G1,G2 devices ∗ Framework: Pytorch, OpenCV","label":[[11,30,"ORG"],[36,50,"TIME"],[51,68,"POSITION"]]}
{"id":9,"text":"Education University of Information Technology-VNUHCM HoChiMinh, VietNam Honor Bachelors Program in Computer Science, GPA: 8.32\/10 Aug. 2017 – June 2021 Honors thesis: Violence detection in videos surveillance based on the approach of deep multiple instance learning ranking • Proposed TOP-K Multiple Instance Learning loss function for Deep Multiple Instance Learning Ranking model, Our method achieves 80.11% AUC, 6.88% Recall, higher than state of the art method. • Build and label a UIT-ViolenceCCTV datasets for the violence detection problem in surveillance-camera video including 110 videos • Experimenting, evaluating and comparing Deep MIL Ranking, Complementary Inner Bag Loss and proposed method Top MIL Ranking • Grade: 9.4\/10.00, PDF, Source code","label":[[10,63,"ORG"],[79,88,"DEGREE"],[100,116,"MAJOR"],[123,130,"SCORE"],[131,152,"TIME"],[732,741,"SCORE"]]}
{"id":10,"text":"EDUCATION FPT CAN THO UNIVERSITY (August 2019 > Current) Major: Software Engineering","label":[[10,32,"ORG"],[34,55,"TIME"],[64,84,"MAJOR"]]}
{"id":11,"text":"Education: ✓ Sept 2012 – Nov 2014: Royal Melbourne Institute of Technology – (Vietnam & Melbourne, Australia) Master of Engineering (Electronic and Computer Engineering) GPA: 3.5\/4.0 o – Fully funded scholarship from Intel Products Vietnam o Top 10% of the class graduates. (All students in this program are selectively sponsored) o ✓ Sept 2007 – Sept 2012: Ho Chi Minh University of Technology, Vietnam o Bachelor of Mechatronics – Vietnamese & French Training Program of Excellence Engineers (PFIEV) – GPA: 8.06\/10.0 o Qualified EUR-ACE Master by European Network for Accreditation of Engineering Education","label":[[13,33,"TIME"],[35,74,"ORG"],[110,116,"DEGREE"],[133,168,"MAJOR"],[175,182,"SCORE"],[335,356,"TIME"],[358,403,"ORG"],[406,414,"DEGREE"],[418,452,"MAJOR"],[509,518,"SCORE"]]}
{"id":12,"text":"WORK AI Research Student UET Robotics Lab 09\/2020 - Present, Achievements\/Tasks Robot Vision System Multimodal AI Robotics Data processing No-code AI platform building","label":[[5,24,"POSITION"],[25,41,"ORG"],[42,59,"TIME"]]}
{"id":13,"text":"EDUCATION Information Technology Department University of Engineering and Technology - VNU 08\/2018 - Present, GPA: 3.22","label":[[10,90,"ORG"],[91,108,"TIME"],[115,119,"SCORE"]]}
{"id":14,"text":"Experience • One Mount Hanoi, Vietnam Junior Data Scientist Oct. 2021 - Present ◦ Automated Valuation Model: ∗ Cleaned and explored data. ∗ Applied mathematics and statistics to build valuation methods. ∗ Built and experimented model. ∗ Visualized and monitored metrics using BI tools (Superset). ◦ Named Entity Recognition Model for real estate text: Built and fine-tuned model based on SOTA methods. ◦ Text-matching algorithm: Word vectorization using TF-IDF, text-compare using cosine similarity. • Viettel Digital Talent Program Hanoi, Vietnam Data Science Intern Apr. 2021 - Jul. 2021 ◦ Early prediction of sepsis from clinical data: ∗ Explored and analyzed data. ∗ Implemented early predicting sepsis model using machine learning. • FPT Software Hanoi, Vietnam Software Engineer Intern Nov. 2020 - Jan. 2021 ◦ Java: Wrote unit and integration test scripts.","label":[[13,37,"ORG"],[39,59,"POSITION"],[60,79,"TIME"],[502,560,"ORG"],[561,567,"POSITION"],[568,589,"TIME"],[739,766,"ORG"],[767,784,"POSITION"],[785,791,"POSITION"],[792,813,"TIME"]]}
{"id":15,"text":"Education • FPT University Hanoi, Vietnam Bachelor of Artificial Intelligence | GPA: 8.29 \/ 10.0 2019 – 2022 ◦ Achievement: Honorable student | Nguyen Van Dao Scholarship 50% Study projects highlights: ◦ ∗ Auto license plate recognize using CNN model. ∗ Flood risk images classification using ViT model. • High School for Gifted Students, Hanoi National University of Education Hanoi, Vietnam Mathematics; GPA: 9.0 \/ 10.0 2016 – 2019","label":[[12,41,"ORG"],[42,50,"DEGREE"],[54,77,"MAJOR"],[85,96,"SCORE"],[97,108,"TIME"],[306,392,"ORG"],[393,404,"MAJOR"],[411,421,"SCORE"],[422,433,"TIME"]]}
{"id":16,"text":"2. EXPERIENCE 7\/2019 – 10\/2019 • Position: Programming internship, FPT Software. Practice programming using core java language 10\/2019 – 8\/2020 • Research AI, deep learning at the laboratory of the Institute of Electronics and Telecommunications • Project: Application of classification of breast cancer tissue by CNN 8\/2020 – 5\/2022 • Position: Technology solution Engineer at Viettel Cyberspace center (VTCC). Support the product manager to develop and manage the Camera AI for Building project • Programming python backend for Camera AI project • Meet customers and collect requirements, analyze customer requirements • Design database Mysql, design Mockup app Timekeeping, API description","label":[[14,30,"TIME"],[43,65,"POSITION"],[67,79,"ORG"],[127,143,"TIME"],[146,154,"POSITION"],[180,245,"ORG"],[318,333,"TIME"],[346,374,"POSITION"],[378,410,"ORG"]]}
{"id":17,"text":"1. EDUCATION • Graduated Hanoi University of Science and Technology • Vice President of Student Union of Hanoi University of Science and Technology • Training Institute: Electronics and Telecommunications • Research majors: AI, Data science","label":[[15,24,"DEGREE"],[25,67,"ORG"],[88,147,"ORG"],[170,204,"ORG"],[224,240,"MAJOR"]]}
{"id":18,"text":"Experience • AI VIETNAM Online Class Team Leader Jul 2021 - Present ◦ Description: Manage a group of 6 students in a 1-year AI course provided by AI VIETNAM. ◦ Key responsibilities: Set weekly goals for team members, prepare coding & AI-related exercises after every lesson. ◦ Expected goal: Publish at least 1 paper in Computer Vision\/Image Processing and be the ﬁrst author in 8 months. Certificates • IELTS 6.5 2020 • Neural Networks and Deep Learning, Coursera 2021","label":[[13,23,"ORG"],[37,48,"POSITION"],[50,67,"TIME"]]}
{"id":19,"text":"Education • FPT University Ho Chi Minh, Vietnam B.Sc. in Artiﬁcial Intelligence; GPA: 9.32\/10; Full Tuition Scholarship Sep 2020 - Apr 2024 (expected) • Nguyen Thuong Hien High School Ho Chi Minh, Vietnam GPA: 8.8\/10 Sep 2017 - Aug 2020","label":[[12,47,"ORG"],[48,53,"DEGREE"],[57,79,"MAJOR"],[86,93,"SCORE"],[153,204,"ORG"],[210,216,"SCORE"],[217,236,"TIME"]]}
{"id":20,"text":"WORK EXPERIENCE Sr. DATA SCIENTIST, Actuate AI, New York City, NY November 2018 - January 2022 ● Designed\/deployed an incremental learning pipeline to autonomate collect\/process data and train\/test\/deploy new models in development, handling 100M+ images per day, data collected based on detection distribution across camera sites, verified daily and sampled to new train\/test database. The distributed auto-train starts weekly with collected\/processed data from inference, model was auto-compiled for AWS Inferentia chips, then model was tested on in-house database and deployed for A\/B testing with custom metrics. Compiling saves 75-80% cost compared to T4 GPU inference, the pipeline reduced up to 80% workload of data science team, leaving only human verification step, impacting all ML products, custom metrics are effective to categorize performance on different environments, settings. After verification, the model was auto-deployed to as an AWS Endpoint and the loop started again. ● Built\/customized machine learning models (YOLO, SSD, EfficientDet) for weapon-detection\/tracking in real-time. Products are able to detect threats (weapons, behavior) with high accuracy (99.95%+) and True Positive, and low False Positive (0-3\/camera\/month). Several models were deployed to almost 25000+ cameras in 1000+ schools and facilities. Using Darknet, Pytorch, inference in AWS Inferentia, tkDNN, OpenCV-dnn. Also deployed on iOS and Android. ● Researched and integrated features to other CV algorithms (segmentation, detection, tracking) for specific tasks (threat, traffic, security). Implemented test-time augmentation, OpenPifPaf, YOLACT++, boosted recall while maintaining precision. Integrated multi-channel training to improve performance of detection on static CCTV. ● Optimized structure of backend logic to reduce cost by 30% while boosting recall and precision. The process: Detect motion, increase frame sampling rate, preprocess input, send input to detection layers, get result & compress frames, send information to database, update logs to analytics platforms. DATA SCIENTIST, Veda Grace Dermatology, Chicago, IL July 2018 – January 2019 ● Implemented image processing features and built classification models based on ResNet to analyze skin images, recognize conditions and provide recommendations for patients. Deployed in AWS Lambda. Using OpenCV and Keras. ● Design\/deployed a pipeline to retrieve information of skincare products, use sentiment analysis models to build a ranking & recommender system. Using Selenium, Beautiful Soup and Surprise.","label":[[20,34,"POSITION"],[36,65,"ORG"],[66,94,"TIME"],[2078,2092,"POSITION"],[2094,2129,"ORG"],[2130,2155,"TIME"]]}
{"id":21,"text":"EDUCATION MSc in Computer Vision - Carnegie Mellon University, Pittsburgh, PA (expected) 2024 Society Behavior Analytics - Linköping University, Sweden 2018 MSc in Data Science - DePaul University, Chicago, IL 2018 BSc in Electronic Commerce - Foreign Trade University, Vietnam 2015","label":[[10,13,"DEGREE"],[17,32,"MAJOR"],[35,77,"ORG"],[89,93,"TIME"],[94,120,"MAJOR"],[123,151,"ORG"],[152,156,"TIME"],[157,209,"ORG"],[210,214,"TIME"],[215,218,"DEGREE"],[222,241,"MAJOR"],[244,277,"ORG"],[278,282,"TIME"]]}
{"id":22,"text":"RESEARCH & SELECTED PROJECTS ● GPT API Reverse Engineering: Approximate\/map big model into a smaller network with minimal loss. ● Model-Agnostic Meta-Learning: Implemented model to adapt to new ICD Code, train\/test on MIMIC III. ● Ensemble of Convolutional Neural Networks for Emotion Classification: Implemented an Ensemble of 10 CNNs from scratch with customizable hyper-parameters, reached 82% accuracy in 10 epochs on CK\/CK+ (Facial Expression). ● 3D Model Reconstruction from 2D Images: Implemented a computer vision model to reconstruct 3D cloud points from 2D images using Epipolar Geometry method. ● Tracker for Darknet YOLOv4: Added object trackers SORT, and background subtraction trackers for CCTV.","label":[]}
{"id":23,"text":" Education HO CHI MINH CITY UNIVERSITY OF TECHNOLOGY 2017 - 2021 Major: Biomedical Engineering GPA: 8.34\/10 FOREIGN LANGUAGE CERTIFICATES English: TOEIC 935 Japanese: JLPT N3 RESEARCH EXPERIENCE My graduation thesis is developing a Medical Imaging Website Application to assist doctors in medical image processing and tumor assessment ACHIEVEMENTS Ho Chi Minh City University of Technology's Encouraging Scholarship KSYS - CUBE Scholarship 2020 GOLF BACH KHOA Scholarship 2020 Odon Vallet Scholarship 2021","label":[[12,53,"ORG"],[54,65,"TIME"],[73,95,"MAJOR"],[101,108,"SCORE"],[349,390,"ORG"],[441,445,"TIME"],[473,477,"TIME"],[502,506,"TIME"]]}
{"id":24,"text":" Work Experience INTERNSHIP AT VIETMED CO., LTD HO CHI MINH, VIET NAM 08\/2020 - 09\/2020 Main responsibilities: - Study manual of ultrasound - Practice using ultrasound machine - Support employees => I gained basic knowledge about ultrasound machine and had the chance to practice using it. In addition, I also improved my specialized document translation skills.","label":[[18,28,"POSITION"],[32,70,"ORG"],[71,88,"TIME"]]}
{"id":25,"text":"WORK EXPERIENCES MACHINE LEARNING TEACHER ASSISTANT CODERSCHOOL, July 2021 - Now Responsible for helping Instructor in Machine learning\/ Data Analyst courses - Handling, debugging students' final project products; - Delivering lectures on fundamental topics of programming and machine learning. DIGITAL MARKETING EXECUTIVE REEPRO SOLAR, Oct 2020 - Mar 2021 Responsible for establishing and maintaining the company's digital assets: -Building and maintaining the company website: www.reeprosolar.com; - Optimize website SEO and establishing digital analytic tools to track website data; - Collaborate with content writer and designer to attract site traffic; - Establishing company profiles on social and other digital channels: Linkedin, Google My Bussiness, Zalo Official Account,...;","label":[[17,51,"POSITION"],[52,63,"ORG"],[65,80,"TIME"],[295,322,"POSITION"],[323,335,"ORG"],[337,356,"TIME"]]}
{"id":26,"text":"EDUCATION & TRAINING CODERSCHOOL DISTRICT 4, HO CHI MINH CITY Data Analysis & Machine Learning BootCamp Mar - June 2021 - Intensive course focusing on best practices of Data Analysis - Studied hands-on machine learning project with real-world application. NATIONAL RESEARCH NUCLEAR UNIVERSITY OF MEPHI, OBNINSK, RUSSIA Bachelor of Nuclear Energy and Thermal Physics Sep 2015 - July 2020 - Full Scholarship by the Vietnamese Government - GPA 4.7\/5.0 Good certificate","label":[[21,32,"ORG"],[62,103,"ORG"],[104,119,"TIME"],[256,318,"ORG"],[319,327,"DEGREE"],[331,365,"MAJOR"],[366,386,"TIME"],[441,448,"SCORE"]]}
{"id":27,"text":"PROFESSIONAL EXPERIENCE  VinAI Research - Website: https:\/\/vinai.io\/ 02\/2021 – 09\/2021 Artificial Intelligence Intern - Conducted analysis and researches on innovating Self-supervised Depth Estimation models. - Redesigned and refactored Monocular Depth Estimation codebase for training, testing, and inferring Monocular Depth Estimation models. - Implemented and reproduced research papers in Motion Segmentation, Monocular Depth Estimation, Optical Flow Estimation, Camera Motion Estimation. - Reviewed data labeling for traffic sign detection.  Meditech Jsc. - Website: https:\/\/iview.vn\/ 03\/2020 - 08\/2020 Computer Vision Intern - Processed data and trained object detection models to detect jewelry in real-time. - Processed data and trained object detection models for Optical Character Recognition application in factories.","label":[[26,40,"POSITION"],[70,87,"TIME"],[88,118,"POSITION"],[549,561,"ORG"],[592,609,"TIME"],[610,632,"POSITION"]]}
{"id":28,"text":"EDUCATION AND TRAINING  Hanoi University of Science and Technology 09\/2015 - 07\/2021 Address: No.1, Dai Co Viet, Hai Ba Trung, Hanoi, Vietnam; Website: https:\/\/www.hust.edu.vn\/ - Degree: Engineer in Mechatronics - Major: Mechatronics Engineering, Talent Programme, GPA: 3.21\/4.00 - Thesis topic: Innovating Visual Perception system in BKDelta robot serving in agricultural production  Vingroup - Artificial Intelligence Engineer Training Program 10\/2020 - 01\/2021 Website: https:\/\/www.vinbigdata.org\/ - Coursework: Linear Algebra, Probability & Statistics, Machine Learning, Deep Learning, Computer Vision, Natural Language Processing, AI Ethics  Shibaura Institute of Technology 09\/2019 - 01\/2020 Address: 3-9-14 Shibaura, Minato-ku, Tokyo 108-8548, Japan; https:\/\/www.shibaura-it.ac.jp\/en\/ - Degree: Exchange Student - Major: Mechatronics Engineering, GPA: 3.29\/4.00","label":[[25,67,"ORG"],[68,85,"TIME"],[188,212,"DEGREE"],[222,246,"MAJOR"],[271,280,"SCORE"],[387,395,"ORG"],[398,430,"POSITION"],[448,465,"TIME"],[650,682,"ORG"],[683,700,"TIME"],[805,821,"DEGREE"],[831,855,"MAJOR"],[862,871,"SCORE"]]}
{"id":29,"text":"WORK EXPERIENCE Vingroup Big Data Institute May 2021 - September 2021 AI Engineer Internship Main responsibilities: - Read documents and implement speech classification models (on age, gender, region) - Carry out preprocessing tasks on Vietnamese speech data School of Information and Communication Technology Sep 2020 - Present (SOICT) - HUST Teaching Assistant (for ELITECH and Data Science - AI programs) Main responsibilities: - Prepare exercises for C, Python and SQL programming in practice classes - Give tutorials to students at practice classes BKC Laboratory - SOICT - HUST Jan 2019 - Present Research Assistant Main responsibilities: - Assist in researching activities that require expertise in Artificial Intelligence and Data Science - Translate scientific documents for researchers of the laboratory Skills gained: - Experience in researching and implementing Machine Learning and Deep Learning algorithms - Basic experience of writing a scientific journal BK0ST Jan 2020 - Present Online teacher Main responsibilities: - Create online videos Series and Differential Equations - Calculus III - Organize online meetings for students to help them revise their knowledge before examinations. - Write solution manuals for recent final exams and homework exercises. Skills gained: - Ability to use tools for scientific documents such as LaTeX and MathType competently - Experience of teaching online for nearly 200 students","label":[[16,43,"ORG"],[44,69,"TIME"],[70,92,"POSITION"],[259,309,"ORG"],[310,328,"TIME"],[344,362,"POSITION"],[554,583,"ORG"],[584,602,"TIME"],[603,621,"POSITION"],[971,976,"ORG"],[977,995,"TIME"],[996,1010,"POSITION"]]}
{"id":30,"text":"EDUCATION Hanoi University of Science and Technology Aug 2018 - Present Major: Computer Science CPA (Cumulative Point Average): 3.79\/4 Type A Scholarship for Excellent Academic Achievements in 2020 Hanoi-Amsterdam High School for the Gifted Aug 2011 - May 2018 Specialized class in Mathematics GPA (12th grade): 9.6 School Awards for Excellent Academic Achievements from 9th to 12th grades","label":[[10,52,"ORG"],[53,71,"TIME"],[79,95,"MAJOR"],[128,134,"SCORE"],[198,240,"ORG"],[241,260,"TIME"],[282,293,"MAJOR"],[312,316,"SCORE"]]}
{"id":31,"text":"Education Portland State University, Portland, Oregon Pursuing Bachelor of Science in Computer Science, Graduated: August 2021 GPA: 3.84 Academic Honors: Dean’s List (1 semester), President’s List (3 semesters) Machine Learning Project: - Project Scope: Worked as part of five-member team to research and build a multiple hidden layers model from scratch and train on mushroom dataset. Try to modify number of nodes in each layer and use different activation functions to figure out the most efficient one for this set of data. Have comparisons between different experiment versions. - Tools: Jupiter notebook, Numpy, Python, Google Colab. - Github link: https:\/\/github.com\/huy26\/Manual-NN-Mushroom-Classifier-using-3-hidden-layers Computer Vision Project: - Project Scope: Worked as part of five-member team to model and train a convolutional neural network on artificial datasets versus train on real datasets. Create FACADE (Fully Algorithmic and Complete Artificial Drawing Engine) to generate artificial hand-drawn polygons and MNIST-like set of hand-drawn digits. Use those artificial data to train on LeNet-5 architecture and compare with real dataset. Use YOLO v3 and v4 along with Darknet to see if artificially generated polygons can be localized in the image. - Tools: Jupiter notebook, Python, Tensorflow, Google Colab. - Github link: https:\/\/github.com\/MechMel\/cs-410-hhpmm-polygon-parser","label":[[10,53,"ORG"],[63,71,"DEGREE"],[86,103,"MAJOR"],[115,126,"TIME"],[132,136,"SCORE"]]}
{"id":32,"text":"Ho Chi Minh University of Science, Ho Chi Minh City, Vietnam Pursuing Bachelor of Science in Computer Science, Transferred to PSU: December 2019 • GPA: 3.54","label":[[0,60,"ORG"],[70,78,"DEGREE"],[93,109,"MAJOR"],[131,144,"TIME"],[152,156,"SCORE"]]}
{"id":33,"text":"EXPERIENCE VinBrain Jan 2021 – April 2021 Applied Scientist Intern VinGroup · Main research topic: Applications of deep learning for chest x-ray analysis, which focused on solving re- lated problems like classiﬁcation, semantic segmentation, and weakly supervised semantic segmentation (using only image-level labels) · Other research interests: Equivariance properties of convolutional neural networks and Visual explana- tions from deep networks via discriminative localization (class-discriminative visualization) Modelling, Simulation And Optimization Laboratory Sep 2019 – Jan 2020 Undergraduate Research Student HUST · Main research topic: Genetic Algorithm applied to solve the Traveling Salesman Problem. The algo- rithm is inspired by the process that supports the evolution of life, designed to replicate the natural selection process to carry generation · Other research interests: Charging algorithms for the wireless rechargeable sensor networks","label":[[11,19,"ORG"],[20,41,"TIME"],[42,66,"POSITION"],[517,566,"ORG"],[567,586,"TIME"],[587,617,"POSITION"]]}
{"id":34,"text":"EDUCATION Hanoi University of Science and Technology (HUST) Fall 2018 - Summer 2022 BSc. in Talented Program in ICT CPA: 3.75\/4.0 HUS High School for Gifted Students (HSGS) Fall 2015 - Summer 2018 Specialized in Mathematics","label":[[10,59,"ORG"],[60,84,"TIME"],[84,88,"DEGREE"],[112,115,"MAJOR"],[121,129,"SCORE"],[130,172,"ORG"],[173,196,"TIME"],[212,223,"MAJOR"]]}
{"id":35,"text":"EDUCATION VNUHCM‑ UNIVERSITY OF SCIENCE BACHELOR'S IN COMPUTER SCIENCE 08.2017 ‑ Present | Thu Duc, Ho Chi Minh City RELEVANT COURSES Artificial Intelligence • Introduction to Data Science • Programming for Data Science • Data Visualization • Data Mining • Digital Image Processing And Computer Vision","label":[[10,39,"ORG"],[40,48,"DEGREE"],[54,70,"MAJOR"],[71,88,"TIME"]]}
{"id":36,"text":"EXPERIENCE • Mar 2020 – Feb 2022: Research student at Ultra-Intelligent Computing\/ Communication Lab, Chung-Ang university, South Korea: ➢ Research in wireless communication field. ➢ Apply deep reinforcement learning algorithms (DDPG, DQN) to solve decision-making optimization problems. • Sep 2019 – Feb 2020: FPGA engineer at Telecommunication Research and Development Institute of VinSmart Research and Manufacture Joint Stock Company: ➢ Design block function of Radio Unit on 5G transceiver base station. ➢ Model design using Matlab and implement on FPGA. • May 2018 – Jul 2019: Logic design engineer at Arrive Technologies Vietnam: ➢ Design block functions of telecommunication chip based on standards.","label":[[13,32,"TIME"],[34,50,"POSITION"],[54,135,"ORG"],[290,309,"TIME"],[311,324,"POSITION"],[328,437,"ORG"],[562,581,"TIME"],[583,604,"POSITION"],[608,635,"ORG"]]}
{"id":37,"text":"TRUONG THANH PHUNG ♂Gender: Male Status: Single Education  Date of birth: 10\/09\/1996 Place of birth: Binh Thuan – Vietnam  Phone: +84 37 637 5137  Email: thanhphung.mr@gmail.com Google scholar: https:\/\/tinyurl.com\/ggscholarThanhPhungTruong","label":[]}
{"id":38,"text":"EDUCATION Chung-Ang University, South Korea MASTER OF ENGINEERING • Department: Computer Science and Engineering. • Major: Big Data. • Time: Mar 2020 – Feb 2022. • Grade: 4.44\/4.5. • Thesis: “Flying IRS – Enhanced Multi-user MISO systems: A Deep Reinforcement Learning Approach”. Ho Chi Minh City University of Technology, VNUHCM BACHELOR OF ENGINEERING • Department: Electrical and Electronics Engineering. • Major: Electronics – Telecommunication. • Time: Oct 2014 – Nov 2018.","label":[[10,43,"ORG"],[44,50,"DEGREE"],[123,131,"MAJOR"],[141,160,"TIME"],[171,179,"SCORE"],[280,329,"ORG"],[330,338,"DEGREE"],[417,448,"MAJOR"],[458,477,"TIME"]]}
{"id":39,"text":"WORK EXPERIENCE Dec 2019 – Mar 2022 Research intern at Cerebro • GAN for virtual clothing try-on. • Using language models as BERT, GPT-2 or BART for building medical chatbot.","label":[[16,35,"TIME"],[36,51,"POSITION"],[55,62,"ORG"]]}
{"id":40,"text":"EDUCATION 2019 – Now FPT University HCMC • Major: Artiﬁcial Intelligence, ﬁnal-year student • GPA: 9.2\/10","label":[[10,20,"TIME"],[21,40,"ORG"],[50,72,"MAJOR"],[99,105,"SCORE"]]}
{"id":41,"text":"EDUCATION MAJOR: COMPUTER SCIENCE Hanoi University of Technology and Science Sep 2018 - Now GPA: 3.72\/4","label":[[17,33,"MAJOR"],[34,76,"ORG"],[77,91,"TIME"],[97,103,"SCORE"]]}
{"id":42,"text":"WORK EXPERIENCE FTECH CO., LTD Web Backend Intern Jul 2021 - Sep 2021 Learnt how to put knowledge into practice to work in a professional ofﬁce environment","label":[[16,30,"ORG"],[31,49,"POSITION"],[50,69,"TIME"]]}
{"id":43,"text":"Experiences Microsoft, Software Engineer Intern May. - Aug. 2022 • Will be working in Data Governance Platform team An Wang’s Networking Lab, Undergraduate Researcher Jan. 2022 - Present • Research focus on exploring and addressing current challenges of Software-Defined Networking including Traffic Engineering and Distributed Load-Balancing in the Control Plane Skipli, Software Engineer Intern Jan. - Apr. 2022 • Developed a scalable Point Of Sale (POS) System that allows restaurant staffs to perform CRUD operations on the menu with MERN Stack and Firebase Firestore • Developed application that supports accepting payments via swipe\/insert\/tap credit or debit card to a card reader using Stripe’s Payment Processor API CMC Corporation, Software Engineer Intern May. - Aug. 2021 • Implemented an automatic exam generator that takes in 10,000 questions of over 12 subjects and parsed into PDF format, reducing time by 500% comparing to creating the tests manually, by using Python and JavaScript • Built cross-platform internal application to enable convenient access and effective tasks management among 5,000 employees by using React Native and TypeScript","label":[[12,21,"ORG"],[23,47,"POSITION"],[48,64,"TIME"],[116,140,"ORG"],[142,166,"POSITION"],[167,186,"TIME"],[358,370,"ORG"],[372,396,"POSITION"],[397,413,"TIME"],[725,740,"ORG"],[742,766,"POSITION"],[767,783,"TIME"]]}
{"id":44,"text":"Education Bachelor of Science in Computer Science, Case Western Reserve University Expected Dec. 2023 • GPA: 3.86\/4.0 - Dean’s High Honor List: 2020, 2021 • Courses: Operating Systems, Database Systems, Computer Networks, Data Structures and Algorithms, Web Development, Data Privacy, Data Science, Game Development, C\/C++ Programming, Number Theory • Activities: Vice President at CWRU Hacker Society, Member at Mathematical Association of America","label":[[10,18,"DEGREE"],[33,49,"MAJOR"],[51,82,"ORG"],[92,101,"TIME"],[109,117,"SCORE"],[144,148,"TIME"],[150,154,"TIME"]]}
{"id":45,"text":"Education University of Information Technology-VNUHCM HoChiMinh, VietNam Honor Bachelor Program in Computer Science, GPA: 8.32\/10 Aug. 2017 – June 2021 Honors thesis: Violence detection in videos surveillance based on the approach of deep multiple instance learning ranking • Proposed TOP-K Multiple Instance Learning loss function for Deep Multiple Instance Learning Ranking model, Our method achieves 80.11% AUC, 6.88% Recall, higher than state of the art method. • Build and label a UIT-ViolenceCCTV datasets for the violence detection problem in surveillance-camera video including 110 videos • Experimenting, evaluating and comparing Deep MIL Ranking, Complementary Inner Bag Loss and proposed method Top MIL Ranking • Grade: 9.4\/10.00, Source code","label":[[10,72,"ORG"],[79,87,"DEGREE"],[99,115,"MAJOR"],[122,129,"SCORE"],[130,151,"TIME"],[731,740,"SCORE"]]}
{"id":46,"text":"Experience VinBrain - Vingroup May. 2021 – Present Applied Scientist • Participate in AI development projects for medical segmentation and diagnostic imaging products and Smart City 3D MRI Image CT-Rectal Tumor Segmentation ∗ Proposed and develop a model of combining a decode-part of U-Net with a Transformer-part and tow decoder-part of VAE-net and Seg-net for the problem of 3 D MRI Image segmentation pixel level for tumor-part. ∗ Analysis, processing and visualization Dataset ∗ Support and collaborate with the web backend development team to deloy the trained AI model to the AWS cloud server and Web service ∗ Framework: Pytorch, OpenCV Coverface detection on surveillance camera - SmartCity ∗ Develop a Yolo model to detection Coverface ∗ Analysis, processing and visualization Dataset ∗ Support and collaborate with the web backend development team to deloy the trained AI model to the AWS cloud server and Web service ∗ Framework: Pytorch, OpenCV MMLab - UIT Oct. 2019 – Present Research Assistant University of Information Technology-VNUHCM • Topic research: Violence detection in video surveillance based on the approach of Deep Multiple Instance Learning Ranking PDF • Advisor: Duy-Dinh Le FPT Software May.2020 – May. 2021 AI Engineer Hochiminh, Vietnam Semantic Segmentation for Teeth dental X-Ray • Proposed and Develop a model of combining U-Net with LSTM\/RNN for the problem of segmentation pixel level for each Tooth of the X-Ray images","label":[[11,30,"ORG"],[31,50,"TIME"],[51,68,"POSITION"],[958,969,"ORG"],[970,989,"TIME"],[990,1008,"POSITION"],[1009,1052,"ORG"],[1204,1216,"ORG"],[1217,1237,"TIME"],[1238,1249,"POSITION"]]}
{"id":47,"text":"Education Ho Chi Minh City University of Technology – Final year Student (9\/2017- 9\/2021)  Major: Control and automation  GPA: 8.29\/10 (Expected to be 8.43\/10 by the time of graduation)  English: TOEIC 980\/990  Student of the honor class  Research experiences:  Computer Vision System for Reading Analog Gauges at Power Substation (Published at ISEE 2021 DOI: https:\/\/doi.org\/10.1109\/ISEE51682.2021.9418754)  A Computer Vision System for Power Transmission Line Inspection Robot (Published at ICSSE 2021 DOI: https:\/\/doi.org\/10.1109\/ICSSE52999.2021.9538440)  Body Temperature and Facemask Identification Using Cameras (Presented at “The 8th Science and Technology Symposium for OISP Students”)","label":[[10,51,"ORG"],[74,88,"TIME"],[99,121,"MAJOR"],[129,136,"SCORE"],[153,160,"SCORE"]]}
{"id":48,"text":"Working Experience Embedded Software Intern Robert Bosch Engineering and Business Solutions Vietnam Co., Ltd. 15th August 2020 – 15th February 2021","label":[[19,43,"POSITION"],[44,108,"ORG"],[110,147,"TIME"]]}
{"id":49,"text":"Work experience Scientific research project 2020, Leader Jun 2020 - Dec 2020 Product: Limb rehabilitation equipment. - Research, survey and form development directions for the project. - Implement a SVM model and program for the project. - Assign tasks to members. Result: Awarded the second prize nationwide. Supporting Dak Lak science and technology team, Adviser Dec 2020 - Apr 2021 Product: Student monitoring and management system. - Support the product design and programming. - Reinforce the knowledge of Facial Recognition for the team. Result: The Dak Lak team won the first prize nationwide.","label":[[16,48,"ORG"],[50,56,"POSITION"],[57,76,"TIME"],[321,356,"ORG"],[358,365,"POSITION"],[366,385,"TIME"]]}
{"id":50,"text":"Education HCMC University of Technology and Major: Mechatronics Aug 2018 - Apr 2022 Education, GPA: 8.42\/10 Rank very good students in 6 terms. Achieve academic scholarships 2020, 2021.","label":[[10,39,"ORG"],[51,63,"MAJOR"],[64,83,"TIME"],[100,107,"SCORE"]]}
{"id":51,"text":"CÁC DỰ ÁN ĐÃ THỰC HIỆN Phân tích đặc điểm của khách hàng - Từ bộ dữ liệu có sẵn từ Kaggle, tiến hành đặt các câu hỏi và sử dụng kỹ năng lập trình cũng như các thư viện hỗ trợ để tiến hành tiền xử lý cũng như rút trích các đặc trưng để trả lời cho các câu hỏi tự đặt ra. - Tham gia với nhiệm vụ xử lý và khám phá dữ liệu, cũng như tự đặt và trả lời một câu hỏi. - Mã nguồn: http:\/\/gg.gg\/projP4DS Thu thập dữ liệu - Phân tích dữ liệu từ SoundCloud - Tiến hành thu thập dữ liệu gồm người dùng (user), danh sách phát (playlist), đoạn nhạc (track) từ trang chia sẻ nhạc SoundCloud bằng parse HTML và API. - Sau đó từ dữ liệu đã thu thập được sẽ tiến hành tự đặt ra các câu hỏi và trả lời chúng. Đồ án này giúp làm quen các bước xử lý dữ liệu cơ bản, phân tích và rút trích các insight từ dữ liệu. - Tham gia với nhiệm vụ tổng hợp kết quả thu thập dữ liệu và tiến hành phân tích dữ liệu, trả lời một câu hỏi do chính bản thân đặt ra. - Mã nguồn: + http:\/\/gg.gg\/proj1DS + http:\/\/gg.gg\/proj2DS Nhận diện tin giả - Fakenews Detection","label":[]}
{"id":52,"text":"HỌC VẤN Đại học Khoa học Tự nhiên - Đại học Quốc gia TP.HCM Ngành Khoa học máy tính - Chuyên ngành Khoa học dữ liệu 09\/2019 - 08\/2023 (dự kiến) - Có kiến thức cơ bản về lĩnh vực CNTT: Cấu trúc dữ liệu, Cơ sở dữ liệu, Lập trình hướng đối tượng, Hệ điều hành, ... - Các kiến thức cơ bản học được từ các môn chuyên ngành: Nhập môn Khoa học dữ liệu, Lập trình cho Khoa học dữ liệu - Đang học và tự tìm hiểu thêm các kiến thức về trực quan hóa dữ liệu và máy học từ các trang học tập trực tuyến cũng như ở giảng đường Đại học.","label":[]}
{"id":53,"text":"EDUCATION • HCMUE - University of Education Aug 2018 - Aug 2022 (Expected) Bachelor of Education, major: Mathematics Teaching, specialization: Optimization, in-major GPA: 7.0\/10 Coursework: Statistic and Probability, Multivariate Calculus, Linear Algebra, Linear Optimization Theory, Non-linear Optimization, Multi-linear Optimization, Multi-Linear Algebra, Differential Equation, Differential Geometry, Statistical Machine Learning,... • AI VIETNAM - Taught by Dr. Dinh Quang Vinh - Dr. Nguyen Hong Phuc July 2021 - July 2022 (Expected) One year track: AI All in one, Major: Computer Vision. Coursework: Basic and Advanced Python, Calculus - Algebra - Optimization for application, Linear Regression, Logistic Regression, Multilayer Perceptron, Genetic Algorithm, Deep Neural Networks, Convolutional Neural Network, Style Transfer, De-Makeup, Image Domain Conversion, Object Detection, Image Segmentation, GAN, ....","label":[[12,43,"ORG"],[44,63,"TIME"],[75,83,"DEGREE"],[105,125,"MAJOR"],[171,177,"SCORE"],[439,449,"ORG"],[505,526,"TIME"]]}
{"id":54,"text":"Education Le Hong Phong High School for the gifted, Math K97 7\/2016  -  7\/2019 University exam score: 28.3\/30 Ha Noi University of Science and Technology, Computer Science K64 9\/2019  -  now CPA: 3.6","label":[[10,50,"ORG"],[52,56,"MAJOR"],[61,78,"TIME"],[110,153,"ORG"],[155,171,"MAJOR"],[176,190,"TIME"],[196,199,"SCORE"]]}
{"id":55,"text":"Working Experience CMC CIST, NLP Internship 01\/2021  -  03\/2021 - Study about NLP, problems related to NLP - Project: Sentiment Analysis Project Capstone, Intro to Machine learning and Data Mining 2\/2022  -  3\/2022 - Project: Image Captioning Project Capstone, Intro to Artiﬁcial Intelligent 2\/2022  -  3\/2022 - Project: Facial Emotion Recognition DS Lab, Research Assistant 12\/2021  -  3\/2022 - Read paper, research - Project: Weakly supervised learning for Aspect Detection","label":[[19,27,"ORG"],[29,43,"POSITION"],[44,63,"TIME"],[197,214,"TIME"],[292,309,"TIME"],[375,394,"TIME"]]}
{"id":56,"text":"WORK EXPERIENCE OIT Help Desk 01\/2022 - present Rutgers University, New Brunswick, NJ, 08901 ● Troubleshooting user’s account ● Provide software\/ hardware support for Rutgers' student, faculty and staff Software Engineer Intern 05\/2021 - 08\/2021 HATCHANDO (VN) LTD, Ho Chi Minh City, Vietnam ● Maintained and improved Windows MS SQL applications ● IT support Software Engineer Intern 05\/2020 - 08\/2020 HATCHANDO (VN) LTD, Ho Chi Minh City, Vietnam ● Maintained Windows MS SQL application","label":[[16,29,"POSITION"],[30,47,"TIME"],[48,85,"ORG"],[203,227,"POSITION"],[228,245,"TIME"],[246,291,"ORG"],[359,383,"POSITION"],[384,401,"TIME"],[402,447,"ORG"]]}
{"id":57,"text":"EDUCATION Rutgers University, New Brunswick, New Jersey: ● M.S in Software Engineering (GPA: 3. 83) Expected 05\/2023 ● B.S in Computer Engineering (Magna Cum Laude) 05\/2021 Dean list (Fall 2019 - Spring 2021)","label":[[10,56,"ORG"],[59,63,"DEGREE"],[66,86,"MAJOR"],[93,98,"SCORE"],[109,116,"TIME"],[119,122,"DEGREE"],[126,146,"MAJOR"],[165,172,"TIME"]]}
{"id":58,"text":"WORK EXPERIENCE April2020 - Present Ha Noi University Of Industry Resercher in University Lab Main responsibilities: -Reserch and implementation about Computer Vison and Deep Learning,Machine Learning application -Reserch and implementation about Internet Of Things application Recognition and Gains: - PID Motor DC Controlled with ARM STM32F4 and ESP8266","label":[[16,35,"TIME"],[36,93,"ORG"]]}
{"id":59,"text":"EDUCATION September 2018 - Present Ha Noi University Of Industry Major: Control Engineering and Automation GPA: 2.62\/4","label":[[10,34,"TIME"],[35,64,"ORG"],[72,106,"MAJOR"],[112,118,"SCORE"]]}
{"id":60,"text":"Education FTU(Foreign Trade University) Ho Chi Minh City, Vietnam BACHELOR OF INTERNATIONAL BUSINESS ADMINISTRATION Aug. 2017 - Apr. 2022 Tran Hung Dao High School for the Gifted Binh Thuan Province, Vietnam MATHEMATICS MAJOR Aug. 2014 - May. 2017 • Top-3 selected talented students to participate in regional\/national Math competitions. 10th grade: 9.7 | 11th grade: 10.0 | 12th grade: 9.2 • Math grade point: SEPTEMBER 28, 2021 HUNG Q. TO · RÉSUMÉ 1","label":[[10,65,"ORG"],[66,74,"DEGREE"],[78,115,"MAJOR"],[116,137,"TIME"],[138,207,"ORG"],[208,220,"MAJOR"],[226,247,"TIME"],[350,353,"SCORE"],[368,372,"SCORE"],[387,390,"SCORE"]]}
{"id":61,"text":"WORK EXPERIENCE March 2015 -April2015 Sustainable research and development centerCSDS Trainee - Train soft skills such as communication, presentation,teamwork June 2018 -July2018 Math and Science Summer Program Mentee - Study about basic machine learning algorithms under the guidance of researchers at universities in the country like UET,... or abroad like MIT, Stanford,... - Develop a project on simple license plate recognition June 2019 -July2019 Math and Science Summer Program PR position - Introducing summer camp to the high school for gifted students with online and offline PR December 2019 -July2020 HAD tech Internship Main responsibilities: - Create OpenCV Filters for Kurento Media Server - Test performance for Big Blue Button Server","label":[[16,37,"TIME"],[38,93,"POSITION"],[160,178,"TIME"],[179,217,"POSITION"],[433,452,"TIME"],[453,487,"POSITION"],[589,612,"TIME"],[613,632,"POSITION"]]}
{"id":62,"text":"EDUCATION Oct 2015 -May2018 High School for Gifted Students, Hanoi National University of Education Major: Computer Science GPA: 8.9\/10 Oct 2018-Present The final year at University of Science and Technology of Hanoi - USTH Major: Information and Communication technology","label":[[10,27,"TIME"],[28,99,"ORG"],[107,123,"MAJOR"],[129,135,"SCORE"],[136,152,"TIME"],[171,223,"ORG"],[231,271,"MAJOR"]]}
{"id":63,"text":"EXPERIENCE Jun 2021– Sep 2021 Applied Scientist Intern • VinBrain Implement decoder module for Automatic Speech Recognition system using Beam Seach algorithm integrated with n-grams language model. Apr 2021– Now Research Assistant • Computational Linguistics Center Learn and research on topics related to Natural Language Processing.","label":[[11,29,"TIME"],[30,54,"POSITION"],[57,65,"ORG"],[198,211,"TIME"],[212,230,"POSITION"],[233,265,"ORG"]]}
{"id":64,"text":"EDUCATION University of Science, VNUHCM (2018 – 2022) Major: Computer Science GPA: 9.37\/10.0","label":[[10,39,"ORG"],[41,52,"TIME"],[61,77,"MAJOR"],[83,92,"SCORE"]]}
{"id":65,"text":"EXPERIENCE 01\/2020 - 08\/2020 Graduation Thesis Ho Chi Minh City University of Technology (HCMUT), Vietnam Project topic: “Design Speech Emotion Recognition System UsingConvolution Neural Network” Objectives: Build, evaluate and improve a system to predict the emotion in speech. Develop a Qt software for users with following fuctions: load speech ﬁle, record speech, replay speech,draw Spectrogram and MFCCs waveforms, predict emotion in speech. Implement the system on embedded board. Programming tools: Python, Qt Designer, pyQt, Keras, TensorFlow, LibROSA Hardware tool: Jetson Nano Developer Kit 08\/2018 - 11\/2020 Intern IC Design Lab - Ho Chi Minh City University of Technology (HCMUT), Vietnam ► Project topic: “Uniform and Protective Equipment Detection System” Missions:  Build a system to detect if a worker wear protective equipment (hard hat, air mask,...) or not. Develop a Qt application for workers to interact and for managers to manage infregement cases. Develop a web server to store images of workers who were not wearing equipments. Programming tools: C++, QtCreator, OpenCV ► Project topic: “Music Genre Classiﬁcation” Missions:  Build a system to classify music genre of an audio. Develop a Qt software for users to interact. Implement the system on embedded board. Programming tools: Python, Qt Designer, pyQt, Keras, TensorFlow, LibROSA Hardware tool: Jetson Nano Developer Kit 09\/2019 - 09\/2021 Teaching Assistant Ho Chi Minh City University of Technology (HCMUT), Vietnam Course name: Computer System Engineering Course content: Basic C++, Basic x86 Assembly, Basic Algorithms Programing tools: C++, x86 Assembly, Visual Studio","label":[[11,28,"TIME"],[47,96,"ORG"],[601,618,"TIME"],[619,625,"POSITION"],[626,700,"ORG"],[1402,1419,"TIME"],[1420,1438,"POSITION"],[1439,1497,"ORG"]]}
{"id":66,"text":"EDUCATOIN 09\/2015 - 11\/2020 Bachelor of Electrical and Electronics Engineering Ho Chi Minh City University of Technology (HCMUT), Vietnam Degree classiﬁcation: Very good GPA: 8.37\/10","label":[[10,27,"TIME"],[28,36,"DEGREE"],[40,78,"MAJOR"],[79,137,"ORG"],[175,182,"SCORE"]]}
{"id":67,"text":"KINH NGHIỆM LÀM VIỆC 09\/2021 - 03\/2022 Masked face detection by Deep learning using Asian face dataset SANSLAB laboratory - Xây dựng phương pháp phát hiện và phân biệt người đeo khẩu trang và không đeo khẩu trang. - Tìm hiểu và đánh giá các bộ dataset phục vụ cho bài toán phân loại khuôn mặt. - Xây dựng bộ dataset phù hợp để áp dụng tại Việt nam. - Áp dụng mô hình phát hiện khuôn mặt vào giai đoạn tiền xử lý. - Tìm hiểu và ứng dụng Transfer learning vào dự án. - Nghiên cứu, huấn luyện và triển khai mô hình MobileNetV2. 04\/2020 - 07\/2021 AICS laboratory - Là thành viên của AICS lab - phòng nghiên cứu ứng dụng AI vào computer vision và xử lý ảnh. - Có nền tảng kiến thức về AI, Machine learning, Deep Learning","label":[]}
{"id":68,"text":"HỌC VẤN 09\/2017 - 03\/2022 Đại học Bách Khoa Hà Nội Viện Điện Tử - Viễn Thông Thesis: Masked face detection by Deep Learning using Asian face dataset. CPA 2.49\/4.0","label":[[8,25,"TIME"],[26,76,"ORG"],[154,162,"SCORE"]]}
{"id":69,"text":"HỌC VẤN Đại học Bách Khoa Hà Nội 10\/2020 - Hiện tại Chuyên ngành: Khoa học máy tính Hệ: Cao học Đại học Bách Khoa Hà Nội 08\/2016 - 08\/2020 Chuyên ngành: Công nghệ thông tin Tốt nghiệp loại: Xuất sắc","label":[[8,32,"ORG"],[33,51,"TIME"],[121,138,"TIME"]]}
{"id":70,"text":"WORK EXPERIENCE FRESHER, R&D DEPARTMENT • MISA JSC • MAY 2021 – PRESENT • Built several in depth customer segmentation reports as well as reports detailing key product insights with respect to customer groups. Created demoes for analyzing key customer groups on Power BI as proofs of concept of such reports. Researched and presented various data mining solutions internally • that not only have been proven industry-wise to be practical but also strongly align with the company’s business considerations.","label":[[16,39,"POSITION"],[42,50,"ORG"],[53,71,"TIME"]]}
{"id":71,"text":"EDUCATION BSC. FINANCIAL MATHEMATICS • UNIVERSITY OF SURREY, UK • 2017 2020 – • Graduated with Upper-Second Honors, which is roughly equivalent to 3.7\/4.0 in American GPA according to the Commission. Fulbright Prominent modules include Bayesian statistics, graph theory, probability and statistics.","label":[[10,13,"DEGREE"],[15,36,"MAJOR"],[39,63,"ORG"],[66,75,"TIME"],[147,154,"SCORE"]]}
{"id":72,"text":"EXPERIENCE 09\/2020- Present Research Assistant – Ulsan National Institute of Science and Technology, South Korea Conducting research experiment   Analyzing data  Writing research paper 03\/2020-08\/2020 Project Management Engineering – Zamil Steel, Vietnam  Creating and controlling jobs’ schedule  Operating and coordinating other departments 05\/2018- 09\/2018 Site Engineer Internship – Unicons Group  Supervising and operating sub-contractors  Inspecting field’s work","label":[[11,27,"TIME"],[28,46,"POSITION"],[49,112,"ORG"],[188,203,"TIME"],[204,234,"POSITION"],[237,257,"ORG"],[347,363,"TIME"],[364,388,"POSITION"],[391,404,"ORG"]]}
{"id":73,"text":"EDUCATION 09\/2020-08\/2022 M.S. Civil Engineering, Ulsan National Institute of Science and Technology, South Korea 09\/2014-08\/2019 B.S. Civil Engineering, Hanoi University of Civil Engineering, Vietnam 01\/2019-06\/2019 Exchanged student, Norwegian University of Science and Technology, Norway","label":[[10,25,"TIME"],[26,30,"DEGREE"],[31,48,"MAJOR"],[50,113,"ORG"],[114,129,"TIME"],[130,133,"DEGREE"],[135,152,"MAJOR"],[154,200,"ORG"],[201,216,"TIME"],[236,290,"ORG"]]}
{"id":74,"text":" EXPERIENCE SUPPORTING MATH CLUB 2019 - 2021 Teaching Math: Algebra, Analytics, Probability MSO LAB 2019 - 2020 GA - Genetic Algorithm Project: WSN - Wireless Sensor Network AIOT LAB - BK.AI 2020 - PRESENT http:\/\/icn.bkai.ai\/ - https:\/\/bkai.ai\/ Project: WRSN - Wireless Rechargeable Sensor Network Project: MP-TCP in 5G: Multipath-TCP Scheduling in 5G","label":[[13,23,"POSITION"],[24,33,"ORG"],[34,45,"TIME"],[93,100,"ORG"],[101,113,"TIME"]]}
{"id":75,"text":" EDUCATION HANOI UNIVERSITY OF SCIENCE AND TECHNOLOGY - HUST 2019 - 2023 Computer science - Talented Program LE HONG PHONG HIGH SCHOOL FOR GIFTED STUDENTS 2016 - 2019 Specializing in math","label":[[12,61,"ORG"],[62,73,"TIME"],[74,90,"MAJOR"],[110,155,"ORG"],[156,167,"TIME"],[184,188,"MAJOR"]]}
{"id":76,"text":"EDUCATIONAL QUALIFICATIONS Institution Major Scholarships \/ CPA Ha Long High School for Gifted Students Informatics Talent class K26 CPA : 8.8 \/ 10 (2015-2018) Scholarship: Scholarship for excellent student for all 3 years. (three times) Hanoi University of Science and Advanced Program of Biomedical Electronics K63 CPA : 3.30 \/ 4.0 Technology (HUST) (School of Electronics and Scholarship: Scholarships for excellent student for 02 semesters (2018-2022) Telecomunications) (2020.1 and 2020.2)","label":[[64,103,"ORG"],[104,115,"MAJOR"],[139,147,"SCORE"],[149,158,"TIME"],[238,265,"ORG"],[323,333,"SCORE"]]}
{"id":77,"text":"WORKING EXPERIENCES Viettel Digital Talent Resident Program • Talent Resident Advanced training and executing on Data Science & Apr 2021 - July 2021 Artificial Intelligence AI Academy VN • AI Intern Jun 2020 – Aug 2020 Learning the fundamental knowledge of AI and ML","label":[[20,35,"ORG"],[62,77,"POSITION"],[128,148,"TIME"],[173,186,"ORG"],[189,198,"POSITION"],[199,218,"TIME"]]}
{"id":78,"text":"EXPERIENCE Research Assistant CVPR lab, Sejong University � Apr. 2020 – present � Seoul, South Korea • Research on Deep Learning models for lab’s project • Implement, train and improve deep learning models • Data labeling and veriﬁcation. • Make proposals for lab’s projects. AI Engineer TMA Innovation Center � Sept. 2018 – Jan. 2020 � Ho Chi Minh city, Vietnam • Develop solution for AI related projects. • Implement, debug and train deep learning models. • Work with Backend team to develop API for AI related fea- tures. • Work with Devops team to deploy deep learning model on server. Quality Control Engineer Tien Tuan Pharmaceutical Machinery Ltd � Sept. 2014 – Mar. 2018 � Ho Chi Minh city, Vietnam • Machine inspection: mechanical, pneumatic, wiring and safety measures. • Machine Functional testing: programming and GUI and sensor calibration. • Write instruction manual.","label":[[11,29,"POSITION"],[30,57,"ORG"],[60,79,"TIME"],[276,287,"POSITION"],[288,309,"ORG"],[312,335,"TIME"],[590,614,"POSITION"],[615,653,"ORG"],[656,678,"TIME"]]}
{"id":79,"text":"EDUCATION Integrated Master’s and Doctor’s program in Com- puter Science and Engineering) Sejong University � Since March 2020 � Seoul, South Korea Bachelor of Engineering in Food technology Hanoi University of Science and Technology � 2008-2015 � Hanoi, Vietnam","label":[[21,28,"DEGREE"],[34,40,"DEGREE"],[54,88,"MAJOR"],[90,107,"ORG"],[116,126,"TIME"],[148,156,"DEGREE"],[175,190,"MAJOR"],[191,233,"ORG"],[236,245,"TIME"]]}
{"id":80,"text":"E D U C A T I O N BACHELOR OF COMPUTER SCIENCE UNIVERSITY OF INFORMATION TECHNOLOGY 2018-Present | GPA: 8.68 NGUYEN BINH KHIEM HIGH SCHOOL FOR THE GIFTED VINH LONG CITY 2015-2018 | Graduation grade: Good","label":[[18,26,"DEGREE"],[30,46,"MAJOR"],[47,83,"ORG"],[84,96,"TIME"],[104,108,"SCORE"],[109,168,"ORG"],[169,178,"TIME"]]}
{"id":81,"text":"EDUCATIONAL BACKGROUND Open University of Hồ Chí Minh city Computer Science major undergraduated 10\/2018 - present Machine Learning course by Stanford university on Coursera taught by Andrew Ng 7\/2021 - 9\/2021","label":[[23,58,"ORG"],[59,75,"MAJOR"],[82,96,"DEGREE"],[97,114,"TIME"]]}
{"id":82,"text":"EDUCATION 8\/ 2018 - Present Hanoi University of Science and Technology Major: Mathematics & Informatics CPA: 3.24\/4.0","label":[[10,27,"TIME"],[28,70,"ORG"],[78,103,"MAJOR"],[109,117,"SCORE"]]}
{"id":83,"text":"WORK EXPERIENCE 7\/ 2020 - 8\/2021 FPT Telecom Intership Here I improved my knowledge of Python and machine leaning. Also, I can build the website using Django and crawling web using Bs4.","label":[[16,32,"TIME"],[33,44,"ORG"],[45,54,"POSITION"]]}
{"id":84,"text":"EXPERIENCE PRIMELABO 06\/2019-08\/2020 I started to work as an intern at Quang Trung Software Park. At that time, I was in the small AI team including 4 members. Our team was researching to figure out a solution for chatbot project. Our first approach was experimented with Rasa 08\/2019-09\/2019 I started to work as a fresher. I was in charge of chatbot project. The first approach was not good enough for our Japanese client. 09\/2019-11\/2019 I experimented with OCR in Japanese to get more data from provided images. This experiment was not good enough. 09\/2019-03\/2020 I experimented with LSTM and BiLSTM for chatbot project. I used Kytea as a tokenizer and fasttext as a pretrained vectors to create word embeddings. BiLSTM was a bit better than Rasa and LSTM. 06\/2020-09\/2020 I experimented with Transformer for chatbot project. I continued to use the pretrained word embedding for Transformer. This experiment was a bit better than BiLSTM. 12\/2020-05\/2022 While the project ended, I was asked by my project manager to try new solutions such as BERT, 4 last layers BERT, Most of them were fine-tunned. RoBERTa,…","label":[[21,36,"TIME"],[61,67,"POSITION"],[71,96,"ORG"],[425,440,"TIME"],[553,568,"TIME"],[762,777,"TIME"],[943,958,"TIME"]]}
{"id":85,"text":"EDUCATION UNIVERSITY OF TECHNOLOGY 2015-12\/2019 This was the period I studied and graduated computer science at the University of Technology.","label":[[10,34,"ORG"],[35,47,"TIME"],[82,91,"DEGREE"],[92,108,"MAJOR"],[116,141,"ORG"]]}
{"id":86,"text":"PROFESSIONAL EXPERIENCE University of Massachusetts, Amherst Residential Assistant August 2021 - Present • Responsible for helping a ﬂoor of 20 students connect with campus resources • Worked with a group of 10 people to communicate with 300 students regarding policy and events Undergraduate Course Assistant (CS198C,CS220,CS230) Jan 2020 - May 2021 • Hosted oﬃce hours to answer questions and help 80+ students debug their code in C and JS Viettel Group Software Engineering Intern May-Aug 2019 • In a team of 5, developed a new QR code login solution using Spring Websockets, which allows user to login to web app directly from phone • Set up new Redis database with Sentinels to provide database to provide support with load balancing • Conﬁgured Jenkins build automation for our project, which enabled us to spread the build workload to multiple nodes and reduce the build times by roughly 75%","label":[[24,60,"ORG"],[61,82,"POSITION"],[83,104,"TIME"],[331,350,"TIME"]]}
{"id":87,"text":"EDUCATION University of Massachusetts, Amherst Exp. graduation May 2022 B.S. Computer Science, Philosophy GPA: 3.8 Relevant coursework: Data Structures & Algorithms, Artiﬁcial Intelligence & Machine Learning","label":[[10,46,"ORG"],[63,71,"TIME"],[72,76,"DEGREE"],[77,105,"MAJOR"],[111,114,"SCORE"]]}
{"id":88,"text":"EDUCATION Formal: • Hanoi University of Science & Technology | Hanoi, Vietnam. • Instrumentation and Industrial Informatics Engineering. Online: • Deep Learning Specialization by Andrew Ng of DeepLearning.Ai. • Data Scientist and Machine Learning Scientist career track in DataCamp • Machine Learning with Python-from Linear Models to Deep Learning (MITx 686x). • Deep learning with Pytorch by Facebook Artificial Intelligence • TensorFlow for Deep Learning – Udacity • CS50 courses of Harvard.","label":[[20,60,"ORG"],[81,135,"MAJOR"]]}
{"id":89,"text":"PROJECTS\/RELEVANT EXPERIENCE 1. DCNN for facial expression recognition: • Worked in a team of 3 to research training Deep Networks for Facial Expression recognition with Crowd-Sourced Label Distribution • Familiarized with CNTK framework. • Learn about the operation and effectiveness of the VGG model for the problem of emotion recognition • Build demo application on streamlit 2. Image Caption Generator: • Worked in a team of 3 to solve the task that is to convert a given input image into a natural language description. • Using TensorFlow, Keras framework to build CNN-LSTM architecture. • Researching CNN models such as VGG, Inception for image feature extraction and LSTM for natural language description generation. 3. Research YOLOv5 for face detection: • Worked in a team of 3 to research the architecture of YOLOv5 • Familiarized with PyTorch framework. • Research how to reuse pre-trained models of YOLOv5 and customize the model to apply to face detection problem • Build demo application on streamlit","label":[]}
{"id":90,"text":"EDUCATION Bachelor Sep 2019 - May 2023 University of Science - VNUHCM, Ho Chi Minh Major: Computer Science GPA: 8.63 \/ 10","label":[[10,18,"DEGREE"],[19,38,"TIME"],[39,82,"ORG"],[90,106,"MAJOR"],[112,121,"SCORE"]]}
{"id":91,"text":"WORK EXPERIENCE Difisoft Joint Stock Company Jun 2019 - July 2021 Financial Analyst • Crawling, processing financial data, financial news, and managing MySQL database. • Backtesting quantitative trading strategies mainly using Python \/ Excel VBA to create alpha. • Generating automated trading program (WinForms C#) and managing multiple strategies under this program • Investing and trading securities. • Analyzing stocks and the financial market.","label":[[16,44,"ORG"],[45,65,"TIME"],[66,83,"POSITION"]]}
{"id":92,"text":"EDUCATION Foreign Trade University, Hanoi, Vietnam 2016 – 2020 Finance & Banking Niagara University, Niagara Falls, NY, U.S.A Jan 2018 – May 2018 Exchange Program","label":[[10,34,"ORG"],[51,62,"TIME"],[63,108,"ORG"],[126,145,"TIME"]]}
{"id":93,"text":"Education Bachelor, Ho Chi Minh University of Technology, Ho Chi Minh City 2017 - 2022 Major: Software Engineering GPA: 3.77\/4 School-level \"ﬁve-good student\"  Class Secretary","label":[[10,18,"DEGREE"],[20,56,"ORG"],[75,86,"TIME"],[94,114,"MAJOR"],[120,126,"SCORE"]]}
{"id":94,"text":"Employment History Intern AI Engineer, I3 Automation, Ho Chi Minh City APRIL 2020 - JUNE 2020 Worked well independently and on a team to solve problems Create a sub-module for detecting face-liveness","label":[[19,37,"POSITION"],[39,52,"ORG"],[71,93,"TIME"]]}
{"id":95,"text":"Experience Two-year experience in Deep Learning with several projects: Image classiﬁcation Face liveness detection Stock price prediction Working with TensorFlow and trained model Experience build a model from scratch and work with trained models. Experience working with real data and preprocessing data Nvidia \"Getting Started with Deep Learning Course\"","label":[]}
{"id":96,"text":"Extra - Curricular activities Member, Hutech IT Club APRIL 2020 – APRIL 2021 Mentor, \"Hutech Digital Race 2021\" APRIL 2020 – APRIL 2021 Setup environment and example Organize competitions for students School-level \"ﬁve-good student\" 2020 - 2021 Doing volunteer activities Teamwork and leadership","label":[[53,76,"TIME"],[112,135,"TIME"],[233,244,"TIME"]]}
{"id":97,"text":"INTERNSHIP EXPERIENCE Texas A&M University August 2021 – Present Graduate Teaching Assistant (GAT) in the Department of Electrical & Computer Engineering for Electrical Design Laboratory (ECEN 403\/404). Guiding undergrad students on projects in the areas of Image Processing, Machine Learning and Microelectronics Nvidia Corporation","label":[[22,42,"ORG"],[43,64,"TIME"]]}
{"id":98,"text":"EDUCATION Texas A&M University, College Station Fall 2021 – Present Master of Science – Electrical Engineering GPA: 3.67\/4 University of Wisconsin-Madison Spring 2021 Visiting International Student Program Birla Institute of Technology and Science, Pilani 2016 – 2020 Bachelor of Engineering Major: Electronics and Instrumentation GPA: 7.81\/10","label":[[10,47,"ORG"],[48,67,"TIME"],[68,74,"DEGREE"],[88,110,"MAJOR"],[116,122,"SCORE"],[123,154,"ORG"],[155,166,"TIME"],[206,255,"ORG"],[256,267,"TIME"],[268,276,"DEGREE"],[299,330,"MAJOR"],[336,343,"SCORE"]]}
{"id":99,"text":"EDUCATION Brisbane, Australia The University of Queensland Feb 2020 – June 2022 • Bachelor of Engineering (Honors) – Major: Software Engineering • Current GPA: 6.4\/7 • Relevant courses: Computer System Principles & Programming, Human-Computer Interaction, Artificial Intelligent, Advanced Data Structures & Algorithms, Design Computing Studio, Engineering Problem Solving, Machine Learning, Compiler and Interpreter, Pattern Recognition and Analysis • Transferred from Ho Chi Minh City University of Technology Ho Chi Minh City, Vietnam Ho Chi Minh City University of Technology Aug 2017 – Dec 2019 • Bachelor Program – Major: Computer Science • GPA: 8.28\/10 • Relevant courses: Discrete Mathematics, Object Oriented Programming, Algorithms & Data Structures, Operating System, Database Systems, Math Modeling, Probability & Statistics Ho Chi Minh City, Vietnam VNU-HCM High School for The Gifted Aug 2014 – Aug 2017 • Math specialized class","label":[[30,58,"ORG"],[59,79,"TIME"],[82,90,"DEGREE"],[124,144,"MAJOR"],[160,165,"SCORE"],[469,510,"ORG"],[537,578,"ORG"],[579,598,"TIME"],[601,609,"DEGREE"],[627,643,"MAJOR"],[651,658,"SCORE"],[862,896,"ORG"],[897,916,"TIME"],[919,923,"MAJOR"]]}
{"id":100,"text":"EXPERIENCE Casual Tutor Ho Chi Minh City University of Technology Sep 2018 – Dec 2018 • Instruct younger students in the university from failing to pass many programming and mathematics courses. • Participated in many renowned competitive programming contests such as Codeforces, Atcoder. • Participated in many Kaggle competitions. Backend Developer Intern GEEK Up JSC Nov 2020 – Jan 2021 • Build Talaria 2.0, a digital platform that helps GEEK Up acquire talents with the right skills, expertise and fast hire, flexible in validating all key aspects as soon as possible in order to match, understand talents. Student VietAI Nov 2020 - Feb 2021 • Complete ML\/DL course in VietAI, an educational organization founded by Research Scientists at Google Brain to build a community of World-class AI talents in Vietnam to solve meaningful and impactful problems for not just Vietnam but also the world. • Complete ML and DL Specialization, NLP Specialization, TensorFlow Developer Professional Certificate courses of Professor Andrew Ng on Coursera. AI Engineer FPT Software March 2022 – Now • Speech Emotion Recognition: Speech processing with audio and focusing on data wrangling • Facial keypoints detection (AI Camp)","label":[[18,23,"POSITION"],[24,65,"ORG"],[66,85,"TIME"],[333,357,"POSITION"],[358,369,"ORG"],[370,389,"TIME"],[611,618,"POSITION"],[619,625,"ORG"],[626,645,"TIME"],[1045,1056,"POSITION"],[1057,1069,"ORG"],[1070,1086,"TIME"]]}
{"id":101,"text":" WORK EXPERIENCE MAR 2021  -  MAY 2021 Gameloft, Programming Intern - Learn deeper knowledge in C++ - Create a personal game   DEC 2021  -  APR 2022 VCCorp, Data Scientist Intern - Implement state-of-the-art models to improve news recommendation system","label":[[18,39,"TIME"],[40,48,"ORG"],[50,68,"POSITION"],[128,149,"TIME"],[150,156,"POSITION"],[158,179,"POSITION"]]}
{"id":102,"text":" EDUCATION Sep 2018  -  Now Hanoi University of Science and Technology, Computer science GPA: 3.35","label":[[12,28,"TIME"],[29,71,"ORG"],[73,89,"MAJOR"],[95,99,"SCORE"]]}
{"id":103,"text":"EXPERIENCES ▪ ZENT Education and Technology Group Hanoi, Vietnam AI Intern April 2020 – Match 2020 Focus on Computer Vision - Apply Machine Learning, Deep Learning in practical problems - Programming Language: Python ▪ FTECH CO., LTD Hanoi, Vietnam AI Intern April 2021 – Present Focus on Computer Vision - Apply Machine Learning, Deep Learning in practical problems - Programming Language: Python","label":[[14,49,"ORG"],[65,74,"POSITION"],[75,98,"TIME"],[219,239,"ORG"],[249,258,"POSITION"],[259,279,"TIME"]]}
{"id":104,"text":"EDUCATION ▪ Ha Noi University of Science and Technology Hanoi, Vietnam Talented Program of Applied Mathematics and Informatics August 2018 - Present ▪ Nghi Son High School Thanh Hoa, Vietnam 2015 - 2018","label":[[12,55,"ORG"],[91,126,"MAJOR"],[127,148,"TIME"],[151,171,"ORG"],[191,202,"TIME"]]}
{"id":105,"text":"  ","label":[]}
{"id":106,"text":"","label":[]}
{"id":107,"text":"EDUCATION Hanoi University of Science and Technology 09\/2017 − 05\/2022 (Expected) B.E in Applied Mathematics and Informatics Cumulative GPA (CPA): 3.45\/4.0","label":[[10,52,"ORG"],[53,70,"TIME"],[82,85,"DEGREE"],[89,124,"MAJOR"],[147,155,"SCORE"]]}
{"id":108,"text":"WORK EXPERIENCE AI Researcher, Grooo International Jsc., Part-time, Internship 10\/2021 − 03\/2022 Researched Face processing problems, object tracking problem. Participated to build camera monitor system. Data Scientist, Viettel Big Data Analystics Center, Part-time, Internship 8\/2021 − 9\/2021 Experienced with Big Data and related tools for Big Data processing. Data Scientist, PIXTA Vietnam Co. Ltd., Part-time, Internship 12\/2020 − 6\/2021 Proposed new classiﬁcation models for age and emotions recognition Researched some deep learning models related to Computer Vision Labeled, visualized and reviewed image datasets. AI Researcher, Techainer Jsc, Part-time, Internship 8\/2020 − 10\/2020 Participant of eKYC project. Researched and built Vietnameese ID Card Recognition module.","label":[[16,29,"POSITION"],[31,55,"ORG"],[79,96,"TIME"],[204,218,"POSITION"],[220,254,"ORG"],[278,293,"TIME"],[363,377,"POSITION"],[379,401,"ORG"],[425,441,"TIME"],[622,635,"POSITION"],[637,650,"ORG"],[674,690,"TIME"]]}
{"id":109,"text":"EDUCATION  Ha Noi University of Science and Technology, Major: Electrical and Automation Sep 2020  -  now GPA: 3.1\/4 Sophomore","label":[[12,55,"ORG"],[64,89,"MAJOR"],[90,106,"TIME"],[112,117,"SCORE"]]}
{"id":110,"text":" WORK Research Intern \/ Aug 2020 - Nov 2020 Worked with Professor at my university. I participated in Traffic4Cast 2020 Challenge in NeurIPS 2020 Competition Track. I built a solu- tion by corporating Convolutional Neurol Net- work and LSTM to extract features from given spatio-temporal data. Tensorflow 1.x CNN RNN","label":[[16,22,"POSITION"],[25,44,"TIME"]]}
{"id":111,"text":" EDUCATION Computer Science - 2021 Bachelor, Honors program at University of Sci- ence, VNU-HCM Thesis Attention Gate in Traffic Forecasting Thesis description The problem of thesis is traffic flow prediction based on given historical frames. Each frame is a traffic flow data rep- resented in the form of an image. To solve the problem, I developed a deep learning model by applying attention mechanism into Convo- lutional Neural Networks. Paper on Arxiv Attention Gate in Traffic Fore- casting","label":[[12,28,"MAJOR"],[31,35,"TIME"],[36,44,"DEGREE"],[64,96,"ORG"]]}
{"id":112,"text":"Research Asistant Data Science Lab Nov 2019-Present • Carry out experiments and researches about Natural Language Processing in Data Science Lab led by Dr. Viet Trung Tran. • Focus on problems relevant to the Vietnamese labor market, such as extracting occupational skills metioned in CV or resumes; developing an efficient model to determine synonyms, hoponyms and hypernyms relation between 2 skills; build and extend a taxonomy of occupational skills;…","label":[[0,17,"POSITION"],[18,34,"ORG"],[35,51,"TIME"]]}
{"id":113,"text":"EXPERIENCE Intern Arrow Technologies Vietnam Jun 2020-Sep 2020 • Drone Solar Panel Inspection o Use open-CV library to detect single panel from solar farm images captured by drone. Convert thermal panel images to gray panel images for classification task. o","label":[[11,17,"POSITION"],[18,44,"ORG"],[45,62,"TIME"]]}
{"id":114,"text":"EDUCATION Hanoi University of Science and Technology 2017-2021 • Bachelor’s degree: Computer Science • GPA: 3.34\/4.0","label":[[10,52,"ORG"],[53,62,"TIME"],[65,73,"DEGREE"],[84,100,"MAJOR"],[108,116,"SCORE"]]}
{"id":115,"text":"EDUCATION Bachelor of Accountancy Bolton University 02\/2014 - 12\/2018, Ho Chi Minh city Bachelor of Information Technology University of Information Technology 02\/2021 - Present, Ho Chi Minh city","label":[[10,18,"DEGREE"],[22,33,"MAJOR"],[34,51,"ORG"],[52,69,"TIME"],[88,96,"DEGREE"],[100,122,"MAJOR"],[123,159,"ORG"],[160,177,"TIME"]]}
{"id":116,"text":"PROFESSIONAL EXPERIENCE FPT SOFTWARE, Ho Chi Minh City, Vietnam . April 2021 - August 2021 Engineering and Research Intern | Cloud, Big Data, and Intelligence Department (CBI) Project 1: Patent Publication of Universal Equivariant PointNet-like MLPs and Group Equivariant CNNs for 3D Point Cloud • Researched 10+ sources on various group rotation equivariance on the 3D point-cloud objects • Built a deep learning model for G-point convolution neural network in object classification, segmentation, and part segmentation, increasing 13% of the accuracy on rotated test data and becoming 1 of 5 official authors of this patent • Coded the Computer Vision model using Pytorch, transforming complicated mathematics equation to become a comprehensive deep learning model that is worth $50,000 Project 2: Medical Image Segmentation for Brain MRI • Researched an AI medical model that scans cancer segmentation images to detect cancer diseases, implemented Capsule network in lung cancer detection, and embedded Convolutional Capsule segmentation on medical images Revised and developed model by embedding 500+ lines of codes, and proposed a new network called Group Equivariant Capsule • network for segmentation, improving 7% accuracy SANGSOFT COMPANY, Ho Chi Minh City, Vietnam August 2021 - December 2021 Machine Learning Engineering Intern • Successfully developed the AI\/ML tools, including OCR tool, traffic and revenue prediction tool by collecting and sanitizing database from 20,000+ data • Worked directly with 5 full-stack developers, 3 designers, and Customer Success team to improve data collection quality by 9% DEPAUW INFORMATION TECHNOLOGY ASSOCIATE PROGRAM, Indiana, US September 2020 – Present Undergraduate Tech Apprentice • Conducted 10+ practicing projects with 6 technological tools: Unity (3D Game-coding), Tableau (Data Visualization), Davinci Resolve and Audacity (Video - Audio Digital Editor), ArcGIS StoryMap, Google Sites • Built Data Conversion program for DePauw University professors to conduct data visualizations by Python, producing a more comprehensive lecture division with 20%+ efficiency • Developed fixed Unity library with built-in packages, which is used for official Computer Science 3D Game Development lecture • Conducted and deployed VR game into Oculus Quest 2 and websites, increasing the number of players to 51% of students","label":[[24,36,"ORG"],[66,90,"TIME"],[91,122,"POSITION"],[1231,1247,"ORG"],[1275,1302,"TIME"],[1303,1338,"POSITION"],[1621,1681,"ORG"],[1682,1706,"TIME"],[1707,1736,"POSITION"]]}
{"id":117,"text":"TECHNICAL EXPERIENCE & SKILLS Coding\/Programming: Python, C++, Java, HTML\/CSS\/JS, Python Django Data-analysis: SQL, Tableau, Data Mining Artificial Intelligence: TensorFlow, Keras, Pytorch, Scikit-Learn Graphic Design: Adobe Photoshop, Illustrator","label":[]}
{"id":118,"text":"EDUCATION DEPAUW UNIVERSITY, Indiana, US September 2020 - May 2024 B.A of Computer Science and Mathematics, GPA: 3.83\/4.0 Honors: Dean’s List for 3 consecutive semesters, starting Fall 2020|Presidential Scholarship for excellent student Coursework: Data Structures, Computer Systems, Object-Oriented Development, Foundation of computation, Programming in Python, Foundations of Advanced Mathematics, Calculus III, Introduction to Economics, Artificial Intelligence, Database, Data Analysis","label":[[10,40,"ORG"],[41,66,"TIME"],[67,70,"DEGREE"],[74,106,"MAJOR"],[113,121,"SCORE"]]}
{"id":119,"text":"EDUCATION HISTORY 2019 - 2023 ROBOTICS AND ARTIFICIAL INTELLIGENCE Ho Chi Minh City University of Technology and education","label":[[18,29,"TIME"],[30,66,"MAJOR"],[67,122,"ORG"]]}
{"id":120,"text":"EDUCATION Hanoi University Of Science & Technology, Hanoi — Bachelor of Science 2017- Present ● Major : Computer Science - GPA 4.00 \/ 4.00","label":[[10,50,"ORG"],[60,68,"DEGREE"],[80,93,"TIME"],[104,120,"MAJOR"],[127,138,"SCORE"]]}
{"id":121,"text":"WORK EXPERIENCE DS-Lab, Hanoi — Student 2020 - PRESENT ● Research Area : Continual Learning , Online Learning, Meta Learning.","label":[[16,29,"ORG"],[32,39,"POSITION"],[40,54,"TIME"]]}
{"id":122,"text":"EDUCATION • B.S. Computer Science Vietnam National University GPA: 3.37\/4 2017-2021","label":[[12,16,"DEGREE"],[17,33,"MAJOR"],[34,61,"ORG"],[67,73,"SCORE"],[74,83,"TIME"]]}
{"id":123,"text":"Education 2015 - 2018 Hoang Le Kha Gifted High School, Tay Ninh, Viet Nam Aug. 2018 - present University of Science, Vietnam National University Ho Chi Minh City - Currently a Bachelor student. - Honors program Faculty of Information and Technology. - Current GPA: 8.52\/10.0. Aug. 2021 - present University of Science, Vietnam National University Ho Chi Minh City - Currently a Master student and Bachelor student. BS-MS program allows students to study 2 programs at the same time.","label":[[10,21,"TIME"],[22,53,"ORG"],[74,93,"TIME"],[117,144,"ORG"],[176,184,"DEGREE"],[265,274,"SCORE"],[276,295,"TIME"],[319,346,"ORG"],[378,384,"DEGREE"],[397,405,"DEGREE"]]}
{"id":124,"text":"EXPERIENCE ❖ Deep learning laboratory in Kyoto Institute of Science and Technology October 2019 - December 2019 (Japan) AI researcher - Work with Prof.Hitoshi Iima about autonomous driving using a reinforcement learning algorithm. - Deep reinforcement learning applied to autonomous driving then simulator on The Open Racing Car Simulator (TORCS) - By simulating on TORCS, the car can move to stick to the road, avoid obstacles on the way and overtake other cars in the race Technologies: - Language: Python, TensorFlow, Keras - DDPG model, Gym TORCS","label":[[13,82,"ORG"],[83,111,"TIME"],[120,133,"POSITION"]]}
{"id":125,"text":"EDUCATION ❖ Hanoi University of Science and Technology August 2017 - present Major: applied Mathematics and Informatics (grade talented engineer) GPA of the previous term: 3.73\/4 CPA : 3.34\/4","label":[[12,54,"ORG"],[55,76,"TIME"],[84,119,"MAJOR"],[172,178,"SCORE"],[185,191,"SCORE"]]}
{"id":126,"text":"❖ PHENIKAA Research and Technology Institute – PRATI 22nd March 2021 - 26th March 2021 Apprentice - Complete \"Autonomous Academy Course\" for one week at Phenikaa University. - Practise set up how to use information from sensors and how to teach the vehicle autonomously to drive on the road. - Because of the support of a ROS environment and LIDAR sensor, with real-time video input, it can be set up to help the car move safely on the road. Technologies: - Environment: Ubuntu, ROS - YOLOv4 model","label":[[2,52,"ORG"],[53,86,"TIME"],[87,97,"POSITION"]]}
{"id":127,"text":"❖ CMC Institute of Science and Technology April 2021 - August 2021 AI researcher - Research about recommendation systems. - Developed a deep reinforcement learning model for the packet registration dataset of a telecommunications company in Vietnam. - By offline evaluation, the model can fit the preference's users with the result of hit ratio metric is up to 0.95. .Technologies: - Language: Python, PyTorch - DDPG model, DQN model, Kmeans","label":[[2,41,"ORG"],[42,66,"TIME"],[67,80,"POSITION"]]}
{"id":128,"text":"❖ Institute of Mathematics of Vietnam Academy of Science and Technology December 2021 - present Researcher - This is Scientific Research Guide Program for Potential Students. - Research graph theory and concentrate on community detection. - Developing the extended version of the application of modularity for the directed graph and preparing to submit it to a journal.","label":[[2,71,"ORG"],[72,95,"TIME"],[96,106,"POSITION"]]}
{"id":129,"text":"EDUCATION Bachelor Advanced Program in Computer Science, Ho Chi Minh city Univer- sity of Science � Sep 2019 – Sep 2023 � Ho Chi Minh city, Vietnam • GPA: 3.97\/4.00 High School Phan Ngoc Hien High School for Gifted Students � Sep 2016 – Jun 2019 � Ca Mau city, Vietnam • Mathematics Class","label":[[10,18,"DEGREE"],[39,56,"MAJOR"],[57,97,"ORG"],[100,119,"TIME"],[155,164,"SCORE"],[177,223,"ORG"],[226,245,"TIME"],[271,282,"MAJOR"]]}
{"id":130,"text":"EXPERIENCE Research Intern AISIA Laboratory � Feb 2022 - Present � Ho Chi Minh city, Vietnam Research Assistant Intern Software Engineering Group, Ho Chi Minh University of Science � Apr 2021 - Oct 2021 � Ho Chi Minh city, Vietnam","label":[[11,26,"POSITION"],[27,43,"ORG"],[46,64,"TIME"],[93,118,"POSITION"],[119,180,"ORG"],[183,202,"TIME"]]}
{"id":131,"text":"WORK EXPERIENCE AI Intern Nautilus Tech JSC 02\/2022 - Present, Hanoi, Viet Nam Smart Retail Solution - IT Services and IT Consulting Achievements\/Tasks Research and testing deeplearning model for object detection. Deploy models to the production environment (Deepstream, Apache Kafka). Participating in daily meeting and sprint review. AI Intern MediTech JSC 05\/2020 - 12\/2020, Hanoi, Vietnam MediTech Joint Stock Company, Cloud Computing - AI – IoT Solution Achievements\/Tasks Working in Computer Vision projects. Data preprocessing (clean data, label data, crawl data). Train deep learning models and evaluation. Deploying models as REST API. Participating in weekly planning meetings. AI Intern VNP Group 11\/2019 - 04\/2020, Hanoi, Vietnam Viet Nam Price Joint Stock Company Achievements\/Tasks Data preprocessing (clean data, label data, crawl data). Building application to extract information from documents. Developing microservices with Flask. Contributing to NER model for CV extraction project. Participating in weekly planning meetings.","label":[[16,25,"POSITION"],[26,43,"ORG"],[44,61,"TIME"],[336,345,"POSITION"],[346,358,"ORG"],[359,376,"TIME"],[688,697,"POSITION"],[698,707,"ORG"],[708,725,"TIME"]]}
{"id":132,"text":"EDUCATION Computer Science (Troy Program) Hanoi University of Science and Technology 2018 - Present, Hanoi, Vietnam","label":[[10,26,"MAJOR"],[42,84,"ORG"],[85,99,"TIME"]]}
{"id":133,"text":"CERTIFICATES IELTS Academic Overall: 6.0","label":[]}
{"id":134,"text":"Education High School for gifted Student (2016-2019) Year 2 student Computer Science Major Hong Kong University of Science and Technology Current CGA: 4.114\/4.3","label":[[10,40,"ORG"],[42,51,"TIME"],[68,84,"MAJOR"],[91,137,"ORG"],[151,160,"SCORE"]]}
{"id":135,"text":"HỌC VẤN THẠC SĨ KINH TẾ QUỐC TẾ TRƯỜNG ĐẠI HỌC KINH TẾ QUỐC DÂN 2016 - 2018 Khá THẠC SĨ CƠ ĐIỆN TỬ TRƯỜNG ĐẠI HỌC BÁCH KHOA HÀ NỘI 2017 - 2020 Khá","label":[]}
{"id":136,"text":"KINH NGHIỆM LÀM VIỆC GIÁM SÁT KINH DOANH & IT CÔNG TYTNHH KỸ THUẬT ĐIỆN VTECH HELPDESK - Giám sát hoạt động kinh doanh VPDD tại Hà Nội 2012 - 2015 - Triển khai các buổi họp báo, hội thảo, triển lãm của công ty. R&D ENGINEER CÔNG TY CP CHẾ TẠO XÂY LẮP CƠ ĐIỆN THÁI VẠN TƯỜNG 2015 - 2019 - Nghiên cứu phát triển các sản phẩm của công ty và các sản phẩm có khả năng thương mại hay sản xuất. - Setup thí nghiệm và thu thập dữ liệu, dùng các Equation fit như linear regression, polinomial regression, tafel fit, Rp fit, v.v cho báo cáo thí nghiệm - Tìm kiếm đối tác, chuỗi cung ứng trong và ngoài nước - Hỗ trợ kỹ thuật và thí nghiệm, thử nghiệm cho khách hàng. - Các công việc liên quan đếm quản lý phòng thí nghiệm","label":[]}
{"id":137,"text":"Education Ho Chi Minh City University of Education Award B.S. in Mathematics (Graduated in October 2019) • GPA 3.82\/4 • Rank #2 graduated of Department of Mathematics • Rank #3 graduated of Ho Chi Minh City University of Education • The Prestigious Certificate of Merit from the President of The University • Thesis: Topological Data Analysis Le Quy Don High School for the Gifted, Ba Ria Vung Tau Province Olympiad Mathematics, 2012-2014 • Second Prize in The Vietnam Mathematical Olympiad (VMO 2014) • Rank #10 in The Vietnam Selection Team Test for IMO (TST 2014) • First Prize in Ba Ria Vung Tau Mathematical Olympiad for 11th and 12th grade students (2012-2014) • First Prize in Mathematics Quizzes Competition Mathematics and Youth Mag- azine • Silver Medal in the 30\/4 Mathematical Olympiad Competition • Merit scholarships for gifted students in Mathematics, Vietnam Institute for Advanced Study in Mathematics Hac Dich High School, Ba Ria Vung Tau Province I studied at this school prior to receiving a scholarship for Le Quy Don High School for the Gifted. • First Prize in Mathematical Olympiad for 10th grade student","label":[[10,50,"ORG"],[57,60,"DEGREE"],[65,76,"MAJOR"],[91,103,"TIME"],[111,117,"MAJOR"]]}
{"id":138,"text":"Scientific 2021–2022 Generative Flow Networks. Research Experience 2020–2021 Multi-scale Representation Learning on Molecular. 2019–2020 Memory Augmented Neural Networks for Reasoning. Structured Dynamic Memory for Reasoning Structured Knowledge Base for Compositional Attention Networks","label":[[11,20,"TIME"],[67,76,"TIME"]]}
{"id":139,"text":"EDUCATION STUDENT Sep 2019 - Present University of Information Technology - VNUHCM Major: Computer Science GPA: 8.66\/10","label":[[18,36,"TIME"],[37,82,"ORG"],[90,106,"MAJOR"],[112,119,"SCORE"]]}
{"id":140,"text":"Professional Experience OCT 2020 - MAY 2021 VinAI Research and VinBigdata, Vingroup - Artiﬁcial Intelligence Engineer ● Enrolled in accelerated courses on Artiﬁcial Intelligence and Data Analysis at Vingroup Big Data Institute. ● Interned at VinAI Research, took part in major technological projects of Vingroup. SEP 2018 - SEP 2020 Vinschool Education System, Vingroup - Program Coordinator\/ O�cer ● Coordinated the design, implementation, and evaluation of the mathematics program at Vinschool member schools. ● Contributed to the Vinschool digital transformation proposal, which is part of the Vingroup - wide digital transformation initiative. ● Coordinated action and training plans for Vinschool member schools in preparation for Council of International Schools (CIS) Accreditation. ● Taught high school students using the Cambridge International Curriculum. OCT 2016 - AUG 2018 Foreign Language Specialized School, National University of Hanoi - Teacher ● Taught Mathematics in English for high school students. ● Trained students in preparation for mathematical Olympiads at the city level. ● Trained students in preparation for standardized tests such as SATs, SSATs, or ACT.","label":[[24,43,"TIME"],[44,83,"ORG"],[86,117,"POSITION"],[313,332,"TIME"],[333,369,"ORG"],[372,391,"POSITION"],[866,885,"TIME"],[886,951,"ORG"],[954,961,"POSITION"]]}
{"id":141,"text":"Education SEP 2013 - JUN 2016 University of Exeter, United Kingdom - BSc (ﬁrst class honours) in Mathematics ● Graduated top of cohort with 3 x Dean's Commendation (one for each academic year). ● Received the Exeter Award and the Exeter Leaders' Award. ● Led groups of students to participate in Exeter Grand Challenges projects. ● Tutored sixth-form students in the Exeter Mathematics School.","label":[[10,29,"TIME"],[30,66,"ORG"],[69,72,"DEGREE"],[97,108,"MAJOR"]]}
{"id":142,"text":"EMPLOYMENT HISTORY • Have a paper about anomaly detection in manufacturing system, co-author with Professor Truong Thu Huong. • Won the third prize in the CYBER SECURITY COMPETITION: BKSEC CTF 2021 competition.","label":[]}
{"id":143,"text":"EDUCATION Undergraduate, School of Electronics and Telecommunications, Hanoi University of Science and Technology MAY 2022","label":[[10,23,"DEGREE"],[25,113,"ORG"],[114,122,"TIME"]]}
{"id":144,"text":"EMPLOYMENT HISTORY Intern Software Engineer at FPT Software, Hanoi September 2019 — July 2020 - Write code & documentation for UI libraries to used in payment applications - Participate in develop simultaneously two payment applications for   two of Vietnam's biggest bank - Majority of time code in Kotlin, in addition also experiences with HTML\/CSS and Python when writing development guide - Worked in two different projects, each with distinct requirements Student Ambassador at School of Computing - University of Leeds, Leeds October 2018 — June 2019 - Worked during university open days and applicant days for the school - Assisted with lab activities and university tour - Talked to student and parents about the university, course and answer any enquiries","label":[[19,43,"POSITION"],[47,59,"ORG"],[67,93,"TIME"],[461,479,"POSITION"],[483,524,"ORG"],[532,556,"TIME"]]}
{"id":145,"text":"EDUCATION Bachelor of Computer Science , University of Leeds 2017 — 2021 A Levels\/IGCSE, British International School Hanoi 2013 — 2017 - A Levels: Business Studies - A, Maths - B, Physics - B, Chemistry - C. - 8 IGCSEs A* - B, include A* for Maths and A for English.","label":[[10,18,"DEGREE"],[22,38,"MAJOR"],[41,60,"ORG"],[61,72,"TIME"]]}
{"id":146,"text":"HỌC VẤN 04\/2014 - 06\/2017 Trường THPT Chuyên Hà Tĩnh Chuyên Toán 10\/2017 - 07\/2022 Đại học Bách Khoa Hà Nội Kỹ Thuật Điều Khiển và Tự Động Hóa Điểm trung bình: 2.9 \/ 4.0","label":[]}
{"id":147,"text":"KINH NGHIỆM LÀM VIỆC 05\/2019 - 08\/2019 Công ty cổ phần Van Vina Thực tập sinh - Hỗ trợ lắp đặt và vận hành máy tiện, máy cắt - Lập trình PLC 12\/2019 - 04\/2021 IOT lab Thành viên - Lập trình C - Lập tình vi xử lí (8051, STM32, Arduino) 09\/2021 - HIện tại VTC Academy Học viên - Lập trình Python - Có kiến thức cơ bản về Machine Learning, Deep Learning, NLP và Computer Vision - Biết các bài toán ứng dụng các thuật toán học máy: có giám sát, không giám sát. - Đã làm các bài toán phân loại Object sử dụng các mạng học sâu (VGG, ResNet, YOLO,…)","label":[]}
{"id":148,"text":"WORK AND RESEARCH EXPERIENCES Start-Up Abroad Insider, YNOT, Hanoi, Vietnam 11\/2020 - Present Chief Operating Officer, General IT Manager ● Founded a social start-up company that provides the youth in Vietnam insights about abroad opportunities. ● Instructed coders to design the web application where customers can find opportunities and discuss ideas with mentors ● Created company policies and trained 10 new employees to adhere to company standards. ● Supervise 30 employees, hold weekly meetings to check on their progress, and offer support. ● Plan monthly strategic outlines on the company's projected revenue in order to increase profits. ● Recruit employees monthly from all around the world for the company (Z1 Pacific Asia), FPT Software, Hanoi, Vietnam 4\/2021 - 7\/2021 Software Engineer Intern Worked with Carlsberg, a Danish multinational brewer. ● Created two web applications by using Low-Code OutSystems technology in web developments ● Communicated with customers from Hong Kong via Microsoft Teams to ensure technological compatibility of the products ● Supported in designing with writing descriptions and requirements of their products (Fville), FPT Software, Hanoi, Vietnam 10\/2020 - 3\/2021 Software Engineer Intern ● Coded both in Front-end And Back-end of the Projects ● Designed a complete website with a database, APIs among layers, and the integration model, satisfying security, repository design pattern ● Developed a web-based application followed by the web service and layered architecture based on MVC UNESCO Youth: Evidence for Change, Hanoi, Vietnam 8\/2018 - 12\/2019 Research Assistant Sponsored by UNESCO Vietnam and UNESCO Pacific-Asia with the aim to support the reform of the Youth Law in Vietnam to ensure a comprehensively revised Youth law and gender equality. ● Assisted in conducting surveys to provide practical evidence to mobilize the Vietnamese government to recognize the LGBT + group's presence in existing legal documents. ● Implemented computer techniques to calculate statistical values from 875 people surveyed. ● Analyzed and interpreted information needed for understanding the trend in attitude, knowledge of the youth towards the LGBTQ community. ● Composed and extracted interview questionnaires to get more exposed to the current situation of the LGBTQ community in Vietnam.","label":[[30,59,"ORG"],[76,93,"TIME"],[94,117,"POSITION"],[119,137,"POSITION"],[736,748,"ORG"],[765,780,"TIME"],[781,805,"POSITION"]]}
{"id":149,"text":"EDUCATION BACKGROUND Denison University Granville, Ohio Bachelor of sciences, Computer science, and Mathematics Expected Graduation: May 2025","label":[[21,55,"ORG"],[56,64,"DEGREE"],[78,111,"MAJOR"],[133,141,"TIME"]]}
{"id":150,"text":"WORK EXPERIENCE INTERN IN AIPOWER COMPANY 8\/2020-9\/2020 • Learn about CAN bus, mpc controller • Using Python to write a simple GUI to communicate between a computer and servo motor (through arduino) • Improve teamwork skill, using git","label":[[16,22,"POSITION"],[26,41,"ORG"],[42,55,"TIME"]]}
{"id":151,"text":"EDUCATION HO CHI MINH CITY UNIVERSITY OF TECHNOLOGY 9\/2017 - Now Major: Control engineering & automation (honor program) Anticipated graduation date: 11\/2021 GPA: 8.62\/10","label":[[10,51,"ORG"],[52,64,"TIME"],[72,104,"MAJOR"],[150,157,"TIME"],[163,170,"SCORE"]]}
{"id":152,"text":"Working Experiences (in chronological order) FPT Software Hanoi Java Web programming intern July 2019–August 2019 Used JDBC to create a demo web project. MSO Lab SOICT - Hanoi University of Science and Technology Hanoi Student researcher July 2019–June 2020 Worked on project about reinforcement learning FPT Software Hanoi Software engineering intern July 2020–September 2020 Worked on project related to analyzing users data and computer vision. VNG Hanoi Game development fresher November 2020–March 2021 Develope a game using Cocos2dx JS for client and Java (Bitzero engine) for backend FPT Software Hanoi AI Intern July 2021–Now Participate in computer vision related projects at team NXT.","label":[[45,57,"ORG"],[69,91,"POSITION"],[92,113,"TIME"],[154,212,"ORG"],[227,237,"POSITION"],[238,257,"TIME"],[448,457,"ORG"],[458,482,"POSITION"],[483,507,"TIME"],[591,603,"ORG"],[610,619,"POSITION"],[620,633,"TIME"]]}
{"id":153,"text":"Education Undergraduate. . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . ○ Hanoi University of Science and Technology Hanoi B.S. Computer Science August 2017–Present Programming experiences.","label":[[251,299,"ORG"],[300,303,"DEGREE"],[305,321,"MAJOR"],[322,341,"TIME"]]}
{"id":154,"text":"WORK EXPERIENCE A2DS (AI-Associated Diagnosis System) 3\/2022 - Present Machine Learning Engineer - Part-time Key achievements: - Currently, I am maintaining the dry eye disease project of A2DS. Grasp the end-to-end data collection and processing to web applications for end-users (hospitals). - Work with Docker for project packaging, AWS for back-end deployment, Postman for API requests and testing, flask for web applications, and basic front-end (Html, CSS, js). A2DS (AI-Associated Diagnosis System) 7\/2021 - 1\/2022 Machine Learning Engineer Intern Key achievements: - Understanding the pipeline of machine learning products. - Computer vision project of eye diagnosis. Learned and practiced with: - Work regularly with Linux, server. - Worked with Pytorch, Detectron2 framework. - Improved code structure. - Tools related: Docker, Postman.","label":[[16,53,"ORG"],[54,70,"TIME"],[71,96,"POSITION"],[467,504,"ORG"],[505,520,"TIME"],[521,553,"POSITION"]]}
{"id":155,"text":"EDUCATION International University, HCMC - VNU HCMC Aug 2018 - Feb 2023 Major: Biomedical Engineering - GPA: 3.2\/4.0 Studying: Machine Learning Engineer","label":[[10,51,"ORG"],[52,71,"TIME"],[79,101,"MAJOR"],[109,116,"SCORE"]]}
{"id":156,"text":"Working Experience • iSciLab Ho Chi Minh, Vietnam Software Engineer Intern Aug 2020 - Oct 2020 ◦ Labeling website: With a large amount of data, labeling them is an arduous task. To alleviate this problem, I built a website which allows user manage their data and automate the labeling process. Related skill: Node.js, Express.js, ReactJS, TypeScript and SQL. ◦ Keypoint detection: I proposed a simple but eﬃcient algorithm for detecting keypoints. ◦ Machine learning (ML) production: In order to learn how to go from a ML experiment to a shipped product, I practiced some relevant tools: Android Studio, TensorFlow Lite. • Department of Telecommunication Engineering Ho Chi Minh, Vietnam Teaching Assistant Nov 2020 - Dec 2020 ◦ Python & Machine Learning Course: I prepared lectures following a pre-deﬁned curriculum, design examples, homework and give feedback to the students in this course (enrollment: 20-25 students).","label":[[21,49,"ORG"],[50,74,"POSITION"],[75,94,"TIME"],[623,687,"ORG"],[688,706,"POSITION"],[707,726,"TIME"]]}
{"id":157,"text":"Education • Ho Chi Minh University of Technology Ho Chi Minh, Vietnam B.E in Computer Science (English program); GPA: 9.22; Expected graduation year: 2021 2016-Present • Luong The Vinh Gifted High School Dong Nai, Vietnam Specialization: Physic 2013-2016","label":[[12,48,"ORG"],[70,73,"DEGREE"],[77,93,"MAJOR"],[118,122,"SCORE"],[155,167,"TIME"],[170,212,"ORG"],[238,244,"MAJOR"],[245,254,"TIME"]]}
{"id":158,"text":"EDUCATION AND TRAINING 01\/09\/2018 – CURRENT – Vietnam FINAL YEAR STUDENT – University of Science, Vietnam National University, Ho Chi Minh city Field(s) of study Advanced Program in Computer Science ◦ 9.37 https:\/\/www.hcmus.edu.vn\/","label":[[23,43,"TIME"],[75,125,"ORG"],[182,198,"MAJOR"],[201,205,"SCORE"]]}
{"id":159,"text":"WORK EXPERIENCE 04\/2000 – CURRENT – Ho Chi Minh, Vietnam RESEARCH ASSISTANT IN UNIVERSITY – SMART ENVIRONMENT LAB Work under the supervision of Associate Professor Tran Minh Triet. Analyze the algorithm, improve the baseline solution and build computer vision models for image classiﬁcation and object detection. 08\/03\/2021 – 01\/11\/2021 – Ho Chi Minh, Vietnam RESEARCH INTERN – VINBRAIN Work under supervision of Dr Nguyen Do Trung Chanh and MSc Pham Quan Dung. Process medical images, build deep learning model for segmentation.","label":[[16,33,"TIME"],[57,75,"POSITION"],[79,113,"ORG"],[313,336,"TIME"],[360,375,"POSITION"],[378,386,"ORG"]]}
{"id":160,"text":"EXPERIENCE Casual Tutor Ho Chi Minh City University of Technology Sep 2018 – Dec 2018 • Instruct younger students in the university from failing to pass many programming and mathematics courses. • Participated in many renowned competitive programming contests such as Codeforces, Atcoder. • Participated in many Kaggle competitions. Backend Developer Intern GEEK Up JSC Nov 2020 – Jan 2021 • Build Talaria 2.0, a digital platform that helps GEEK Up acquire talents with the right skills, expertise and fast hire, flexible in validating all key aspects as soon as possible in order to match, understand talents. Student VietAI Nov 2020 - Feb 2021 • Complete ML\/DL course in VietAI, an educational organization founded by Research Scientists at Google Brain to build a community of World-class AI talents in Vietnam to solve meaningful and impactful problems for not just Vietnam but also the world. • Complete ML and DL Specialization courses of Professor Andrew Ng on Coursera.","label":[[18,23,"POSITION"],[24,65,"ORG"],[66,85,"TIME"],[333,357,"POSITION"],[358,369,"ORG"],[370,389,"TIME"],[611,618,"POSITION"],[619,625,"ORG"],[626,645,"TIME"]]}
{"id":161,"text":"EDUCATION Brisbane, Australia The University of Queensland Feb 2020 – Dec 2021 • Bachelor of Engineering (Honors) – Major: Software Engineering • Current GPA: 6.25\/7 • Relevant courses: Computer System Principles & Programming, Human-Computer Interaction, Artificial Intelligent, Advanced Data Structures & Algorithms, Design Computing Studio, Engineering Problem Solving, Machine Learning, Compiler and Interpreter, Pattern Recognition and Analysis • Transferred from Ho Chi Minh City University of Technology Ho Chi Minh City, Vietnam Ho Chi Minh City University of Technology Aug 2017 – Dec 2019 • Bachelor Program – Major: Computer Science • GPA: 8.28\/10 • Relevant courses: Discrete Mathematics, Object Oriented Programming, Algorithms & Data Structures, Operating System, Database Systems, Math Modeling, Probability & Statistics Ho Chi Minh City, Vietnam VNU-HCM High School for The Gifted Aug 2014 – Aug 2017 • Math specialized class","label":[[30,58,"ORG"],[59,78,"TIME"],[81,89,"DEGREE"],[123,143,"MAJOR"],[159,165,"SCORE"],[537,578,"ORG"],[579,598,"TIME"],[601,609,"DEGREE"],[627,643,"MAJOR"],[651,658,"SCORE"],[862,896,"ORG"],[897,916,"TIME"],[919,923,"MAJOR"]]}
{"id":162,"text":"EXPERIENCE Software Engineer Boost Commerce | Apr 2021 - Mar 2022 - Work as backend developer: design, implement API, write API document and technical specification. - Related skills: NodeJS, MongoDB, Redis, Elasticsearch, Docker, AWS. ASSIGNMENTS Online Shopping Website Technologies: HTML, CSS, Javascript, PHP, MySQL - Design and build a layout using HTML, CSS, and Javascript. - Design and build a database using MySQL. - Build a backend using PHP (core). Movie Review Application Technologies: Python - Define the requirements of the project. - Research and integrate the recommendation system into the backend. Chat Application Technologies: ReactJS, Express, NodeJS, MongoDB - Build chat web application Data Conversion Tool (Graduation Thesis) Technologies: Python, MySQL, MongoDB, Docker - Build a tool that converts data from Relational Database (MySQL) to NoSQL (MongoDB)","label":[[11,28,"POSITION"],[29,43,"ORG"],[46,65,"TIME"]]}
{"id":163,"text":"ACADEMIC BACKGROUND Ho Chi Minh University of Technology Bachelor of Engineering in Computer Science | 2014 - 2021 GPA: 6.5 - Member, Bach Khoa Entrepreneurship and Innovation Club - Member, Bach Khoa HCM Basketball","label":[[20,56,"ORG"],[57,65,"DEGREE"],[84,100,"MAJOR"],[103,114,"TIME"],[120,123,"SCORE"]]}
{"id":164,"text":"Education Hanoi University of Science and Technology 1 Dai Co Viet, Ha Noi Engineering of Applied Mathematics and Informatics (Talent program) Sep. 2016 – Present • GPA: 3.22\/4 • Thesis: Forecasting the volatility of Vietnam’s stock market using hybrid model GARCH-BiLSTM Academic Experience Research Intern: Applied Statistics July 2020 – Oct 2020 Department of Probability and Statistics -Institute of Mathematics, VAST 19 Hoang Quoc Viet, Ha Noi Collaborator: The Mathematics Club of NDNT Apr 2018 – June 2019 Vietnam Institute for Advanced Study in Mathematics 157 Chua Lang, Ha Noi","label":[[10,52,"ORG"],[90,125,"MAJOR"],[143,162,"TIME"],[170,176,"SCORE"],[328,348,"TIME"],[349,421,"ORG"]]}
{"id":165,"text":"WORK EXPERIENCE DataScience Laboratory Apr 2020 - present Member I research on Machine Learning models for big and streaming data. I focus on Continual Learning FTECH CO., LTD Jun 2021 – Oct 2021 AI Engineer Intern","label":[[16,38,"ORG"],[39,57,"TIME"],[58,64,"POSITION"],[161,175,"ORG"],[176,195,"TIME"],[196,214,"POSITION"]]}
{"id":166,"text":"Experience Oct 2020 – present Multimedia Communications Laboratory - University of Information and Technology Undergraduate Research Assistant Assisting the researcher in conducting experiments and managing research projects Observations research procedures, recording results, drawing inferences about experiments, and making reports on conclusions Research interest: - Computer Vision, Deep Learning - Generative adversarial networks, Image-to-Image translation problems - Reinforcement Learning","label":[[11,29,"TIME"],[30,109,"ORG"],[124,142,"POSITION"]]}
{"id":167,"text":"Education Aug 2019 – present University of Information and Technology, VNUHCM Faculty of Computer Science Expected graduation: June 2023 Honour program GPA 9.13\/10","label":[[10,28,"TIME"],[29,77,"ORG"],[89,105,"MAJOR"],[127,136,"TIME"],[156,163,"SCORE"]]}
{"id":168,"text":" WORK EXPERIENCE SMART MANUFACTURING INNOVATION CENTER - BECAMEX IDC OCT 2021 - PRESENT VIETNAM AI-IoT Engineer Main responsibilities: - A member of the Industrial IoT - Edge Computing team (Team sized: 5). We develop solutions for Smart Pole - an important source of information collection in the future Internet of Things ﬁeld and an important part of the smart city. - I am in charge of the development of an AI camera based on edge devices used for detecting, tracking, counting, and determining the direction of movement of vehicles in the observation area. Traﬃc ﬂow information will be later used to control trafﬁc lights. - Participate in the development of an industrial IoT gateway. Achievements and skills gained: - The solution is being piloted at the intersection of National Highway 13 - NA2 in Binh Duong province. (Link:  https:\/\/mattdinh-aiﬁghter.com\/giai-phap-giam-sat-giao-thong-thong- ). The evaluation parameters show that the proposed solution helped to increase trafﬁc minh ﬂow intensity on the calculated lane in a trafﬁc signal phasing by 10-15%. - Experience in implementing deep learning models on embedded computers. - Experience with Git Flow and Agile. IEC TEAM ( INTELLIGENT EDGE COMPUTING) OF VNUHCM-UIT JULY 2021 - SEP 2021 AI-IoT Research Intern – Part-time Contract (Sponsored by Becamex IDC) Main responsibilities: - Participate to build a thermal camera using Jetson Nano + FLIR Lepton 3.5 IR Camera + RPI Camera V2  for covid-19 detection. Recognition and Gains: - Learn about the MTCNN face detection algorithm and how to deploy it on Jetson Nano. - Product Plan Management - Teamwork skill","label":[[18,69,"ORG"],[70,88,"TIME"],[97,112,"POSITION"],[1184,1236,"ORG"],[1237,1257,"TIME"],[1258,1280,"POSITION"]]}
{"id":169,"text":"W O R K E X P E R I E N C E Financial Software Solutions - Data Scientist O C T O B E R 2 0 2 1 T O P R E S E N T Stock Price Manipulation Detection: https:\/\/github.com\/hieule88\/fssstock Researched on stock market domain. Processed data and applied Machine Learning models for panel data. Deployed models using Django, Celery. VCCORP - AI Researcher J A N 2 0 2 1 T O J U L Y 2 0 2 1 Speech Enhancement: https:\/\/github.com\/hieule88\/DeepDenoise Utilized Deep Complex Convolutional Recurrent Network: A deep learning model using CNN and LSTM - SOTA 2021. Speech Separation: https:\/\/github.com\/hieule88\/SpeechSeparation Utilized SepFormer : A deep learning model using Transformer - SOTA 2021. Data Science LAB - MSO Lab - Student Research Assistant A P R I L 2 0 2 0 T O M A R C H 2 0 2 2 Researched Deep Generative Models: VAE, GANs. Researched Genetic Programming. Co-author of TF-GeneNAS: An evolution-based training-free approach to Neural Architecture Search accepted at IEEE IJCNN 2022","label":[[28,56,"ORG"],[59,73,"POSITION"],[74,113,"TIME"],[327,333,"ORG"],[336,349,"POSITION"],[350,383,"TIME"],[691,717,"ORG"],[720,746,"POSITION"],[747,786,"TIME"]]}
{"id":170,"text":"EDUCATION VNUHCM - University of Information Technology Aug 2018 – Expected Aug 2022 Bachelor of Science in Computer Science Cumulative GPA: 8.52\/10 Coursework: Artificial intelligence, Machine learning, Introduction to Computer Vision, Advanced Computer Vision, Computer graphics, Deep Learning and Applications, Data mining and","label":[[10,55,"ORG"],[56,84,"TIME"],[85,93,"DEGREE"],[108,124,"MAJOR"],[141,148,"SCORE"]]}
{"id":171,"text":"EXPERIENCES Basic knowledge of Software Engineering Foundation knowledge about Machine Learning, AI Foundation knowledge about Probability Theory Interested in Computer Vision and Image Processing Intermediate knowledge of Web Development Basic knowledge of Network Programming Finished Courses Machine Learning by Andrew Ng - Coursera. Finished Books Deep Learning for Computer Vision with Python 1,2,3 by Adrian Rosebrock. On-going Courses TensorFlow Developer Certificate in 2022: Zero to Mastery by Daniel Bourke","label":[]}
{"id":172,"text":"EDUCATIONS Computer Science major in Global ICT Program Current CPA : 3.3\/4.0, A Probability Theory, A Computer Vision Estimated Graduation: June-July 2022","label":[[11,27,"MAJOR"],[37,55,"ORG"],[70,77,"SCORE"],[141,155,"TIME"]]}
{"id":173,"text":"WORK EXPERIENCE VCCorp    AI Engineer SEP 2021  -  - Learning and researching clustering algorithms - Applying the clustering algorithm to the company's problems PTIT    Graduation thesis AUG 2021  -  - Learn about the architecture application of Generative adversarial network   - Application of GAN in the problem of improving the resolution of images VNPT-IT    NLP Engineer Intern JUL 2021  -  - Learn about deep learning and natural language processing on Coursera's Deep Learning Specialization - Learn about attention mechanism and Transformer architecture in natural language processing. - Using PhoBert for text classiﬁcation problem DD Solution    Python developer  MAR- 2021  -  - Database design for Resume information extraction project - Using Flask, Django implements a candidate information extraction module in curriculum vitae","label":[[16,22,"ORG"],[27,38,"POSITION"],[39,47,"TIME"],[163,167,"ORG"],[190,198,"TIME"],[356,363,"ORG"],[368,387,"POSITION"],[388,396,"TIME"],[646,657,"ORG"],[662,678,"POSITION"],[680,689,"TIME"]]}
{"id":174,"text":"EDUCATION Posts and Telecommunication Institute of Technology Sep 2017  -  Feb  2022 Major: Information Technology GPA: 2.74\/4","label":[[10,61,"ORG"],[62,84,"TIME"],[92,114,"MAJOR"],[120,126,"SCORE"]]}
{"id":175,"text":"WORK EXPERIENCE Front-end Web Developer BT tech corporation 03\/2019 - 08\/2019, Hanoi, Vietnam Achievements\/Tasks Maintain and develop responsive websites. Finish the reusability scripts, Restful API. AI engineer Intern Vin Bigdata 09\/2020 - Present, Hanoi AI engineer talents program Achievements\/Tasks Top 3 Vin Bigdata hackathon Get 14\/15 in coding test in hiring process Passed 2 phased, I'm in the last phase: real-world tasks in one P&L of Vingroup Contact : - Pham Thu Huyen: program manager v.huyentt40@vinbigdata.org","label":[[16,39,"POSITION"],[40,59,"ORG"],[60,77,"TIME"],[200,218,"POSITION"],[219,230,"ORG"],[231,248,"TIME"]]}
{"id":176,"text":"EDUCATION MITx MicroMaster Statistics and Data Science MIT-edx 12\/2021 - 05\/2022, GPA: 3.4 Undergraduate, CS HUST-TROY Hanoi 07\/2020 - 01\/2021, GPA: 4.0 Undergraduate, CS ASU, Texas 12\/2019 - 02\/2020, 2601 W Ave N, San Angelo, TX 76909, United St Agency: Ellacy ege.sgn@ellacy.org Duong: +84 96 996 06 19 Undergraduate, CS FPT Hanoi 07\/2018 - 07\/2019, GPA: 3.48 High school (IT and mathematics major) High school for gifted students 07\/2015 - 07\/2018,","label":[[10,62,"ORG"],[63,80,"TIME"],[87,90,"SCORE"],[106,118,"ORG"],[125,142,"TIME"],[149,152,"SCORE"],[168,181,"ORG"],[182,199,"TIME"],[320,326,"ORG"],[333,350,"TIME"],[357,361,"SCORE"],[401,432,"ORG"],[433,450,"TIME"]]}
{"id":177,"text":"EDUCATION & WORK EXPERIENCE Aug 2016 - Sept 2021 Hanoi University of Science & Technology Electronics and Telecommunication - Graduated July 2021 - Present Pythonology Web Development - Outsourcing - Full time Frontend developer Mar 2021 - Jun 2021 Kaopiz Solutions AI Intern - Research Computer vision - Object detection, FSL, OCR, etc. Oct 2019 - Aug 2020 FPT Software - Full time C++ Developer Debugger, Code API Testing, OOP, SFML, etc. Oct 2018 - Jun 2019 ANALOG IC DESIGN LAB Research","label":[[28,48,"TIME"],[49,89,"ORG"],[90,123,"MAJOR"],[136,155,"TIME"],[156,183,"ORG"],[210,228,"POSITION"],[229,248,"TIME"],[249,265,"ORG"],[266,275,"POSITION"],[338,357,"TIME"],[358,370,"ORG"],[383,405,"POSITION"],[441,460,"TIME"],[461,490,"ORG"]]}
{"id":178,"text":"EDUCATION Bachelor Ho Chi Minh University of Science � Sept 2019 – June 2023 High School Phan Ngoc Hien High School for Gifted � Sept 2016 – June 2019 Mathematics class","label":[[10,18,"DEGREE"],[19,52,"ORG"],[55,76,"TIME"],[89,127,"ORG"],[129,150,"TIME"],[151,162,"MAJOR"]]}
{"id":179,"text":"EXPERIENCE Research Assistant Intern Software Engineering Group, Ho Chi Minh University of Science � 6 months � Ho Chi Minh city, Vietnam • I participated in Software Engineering research team at my school. I did research about intelligence and automatic testing in web ap- plications.","label":[[11,36,"POSITION"],[37,98,"ORG"]]}
{"id":180,"text":"EDUCATION • University of Greenwich VietNam(Grad: Dec 2020) • Major: Software Engineering • GPA: 8.5\/10","label":[[12,43,"ORG"],[50,58,"TIME"],[69,89,"MAJOR"],[97,103,"SCORE"]]}
{"id":181,"text":"W O R K E X P E R I E N C E Intern at Computer Scientist postition Bosch R&D Automotive Center HCMC - Nov 2021 to Now Building and deploying models for regression problem in manufacturing line for automotive parts Work with SQL, Spark and other libraries for data analysis Analyzing source code for stimulation of ECU","label":[[28,34,"POSITION"],[67,99,"ORG"],[102,117,"TIME"]]}
{"id":182,"text":"E D U C A T I O N A L H I S T O R Y Ho Chi Minh University of Science - VNU-HCM BSc Information Technology | Sep 2017 - Mar 2022 GPA: 3.17\/4.00 Major in Computer Science The thesis involved in analyze paraphrase documents and detect them between Vietnamese and English. (Finished with excellent score and published paper)","label":[[36,79,"ORG"],[80,83,"DEGREE"],[84,106,"MAJOR"],[109,128,"TIME"],[134,143,"SCORE"],[153,169,"MAJOR"]]}
{"id":183,"text":"EXPERIENCE Incoming Software Engineer Intern, AthenaHealth Jun 2022 - Aug 2022 · Contributing to Practice Management and Collector Tools products. Computer Vision Graduate Research Assistant, Northeastern University Mar 2022 - Present · Implemented Deep Learning models (FlowNet, RAFT) to estimate optical ﬂow in sports video. Developed models to interpolate intermediate frames and generate slow motion videos. Computational Biologist, Singapore Bioinformatics Institute Jun 2018 - Aug 2021 · Developed novel high-dimensional statistical analysis deployed on Google Cloud Platform web app with R-Shiny and HTML. · Implemented MATLAB program with GUI for automated image segmentation of 3 diﬀerent fat compartments by polar image transformation and edge detection. Gained overall 88% accuracy. (Poster)","label":[[20,44,"POSITION"],[46,58,"ORG"],[59,78,"TIME"],[172,190,"POSITION"],[192,215,"ORG"],[216,234,"TIME"],[412,435,"POSITION"],[437,471,"ORG"],[472,491,"TIME"]]}
{"id":184,"text":"EDUCATION Northeastern University, US Sep 2021 - (expected) May 2024 MS - Computer Science. CGPA: 4.0 Nanyang Technological University, Singapore Aug 2013 - Jul 2017 BS - Engineering. CGPA: 3.85","label":[[10,37,"ORG"],[38,68,"TIME"],[69,71,"DEGREE"],[74,90,"MAJOR"],[98,101,"SCORE"],[102,145,"ORG"],[146,165,"TIME"],[166,168,"DEGREE"],[171,182,"MAJOR"],[190,194,"SCORE"]]}
{"id":185,"text":"WORK EXPERIENCE AI Engineer intern Mitek J.S.C Jan 2022 - Present Work on create 3D character base on human captured by camera using machine learning","label":[[16,34,"POSITION"],[35,46,"ORG"],[47,65,"TIME"]]}
{"id":186,"text":"EDUCATIONAL BACKGROUND Open University of Hồ Chí Minh city Undergraduate in Computer Science Sep 2018 - Sep 2022 (Expected)","label":[[23,58,"ORG"],[76,92,"MAJOR"],[93,112,"TIME"]]}
{"id":187,"text":"EXPERIENCE Developing hand detecting application for presentation | Capstone Project 3\/2021 – 6\/2021 Detect (using YOLO) and classify hand gesture (counting fingers) to control cursor and power-point slideshow. Naïve Bayes Classifier for Face recognition| Image Processing Project The project based on eigenfaces with the help of Naïve Bayes for recognition. Automatic number-plate recognition| Computer Vision Project Trained neural nets to detect plates, and classify digits. Embedded Software Intern| Robert Bosch Vietnam RBVH Co., Ltd 7\/2021 – 9\/2021 Develop a Jenkins’ CI\/CD system for periodically building code.","label":[[85,100,"TIME"],[487,502,"POSITION"],[504,538,"ORG"],[539,554,"TIME"]]}
{"id":188,"text":"EDUCATION Electronics and Telecommunications Engineering | HCM University of Technology 8\/2018 – 11\/2022 Major: Embedded System Programming, Digital Image Processing and Computer Vision. GPA: 8.77","label":[[10,56,"MAJOR"],[59,87,"ORG"],[88,104,"TIME"],[192,196,"SCORE"]]}
{"id":189,"text":"WORK EXPERIENCE AI Engineer 09\/2021 — Present Sun Asterisk VN • Project PDF converter � – Developed a system to convert scan PDF files to other extensions such as Word, Excel. – Researched and collect data for deep learning models used in the system. – Implemented microservice pattern for the system. • Rental car service dynamic pricing - Client project – Cleaned and processed data using pandas and Google Big Query – Implemented dashboard to visualize rental data using Google Data Studio. • Project Audio book – Science project in collaboration with VOV radio station. – Applied text to speech technology to produce audio books. AI Engineer Intern 11\/2020 — 09\/2021 Sun Asterisk VN • License plate recognition - PoC � – Researched deep learning methods for Vietnamese license plates detection and recognition. – Deployed model on NVIDIA Jetson Nano. AI Engineer Intern 06\/2020 — 08\/2020 Skymap Global VN • Worked with QGIS to interact with satellite images. • Developed deep learning model to automatically extract building footprint from satellite images.","label":[[16,27,"POSITION"],[28,45,"TIME"],[46,61,"ORG"],[634,652,"POSITION"],[653,670,"TIME"],[671,686,"ORG"],[855,873,"POSITION"],[874,891,"TIME"],[892,908,"POSITION"]]}
{"id":190,"text":"EDUCATION Hanoi University of Science and Technology 2017–2022 Applied Mathematics & Informatics - Engineer’s degree - GPA: 3.48\/4.0 Coursework: Data Structures\/Algorithms, Artificial Intelligence, Optimization Methods, Data Analysis, Time Series Analysis","label":[[10,52,"ORG"],[53,62,"TIME"],[63,96,"MAJOR"],[124,132,"SCORE"]]}
{"id":191,"text":"WORK EXPERIENCE FREELANCE WORK 2018 - 2019 Wedding Waiter Skills gained: Be a better listener and more careful. WORK IN UNIVERSITY 2019 - present Undergraduate\/ Member in a group Main responsibilities:- Complete the group assignments or projects related to my major assigned by lecturers. Skills gained:- Practice teamwork skills. - Acquire more about these topics","label":[[31,42,"TIME"],[43,57,"ORG"],[131,145,"TIME"]]}
{"id":192,"text":"EDUCATION Hanoi University of Science and Technology 2018 - present Major: Compute Science GPA: 2.5\/4","label":[[10,52,"ORG"],[53,67,"TIME"],[75,90,"MAJOR"],[96,101,"SCORE"]]}
{"id":193,"text":"WORK EXPERIENCES TMA Innovation Dec 2020 – Dec 2021 AI Engineer Intern - Part-time • Working and improving deep learning model for object detection and object segmentation. • Image processing with OpenCV. • Developing deep learning model for edge devices. • Data generation for deep learning model's training.","label":[[17,31,"ORG"],[32,51,"TIME"],[52,70,"POSITION"]]}
{"id":194,"text":"EDUCATION FPT University Sep 2018 – May 2022 Major: Software Engineering GPA: 8.5\/10 VietAI Machine Learning Foundation class May 2020 – July 2020 Link: http:\/\/vietai.org\/ Achievement: Distinction level (top 10) Le Quy Don High School for the Gifted, Da Nang May 2015 – May 2018 Mathematics specialist GPA: 8.8\/10","label":[[10,24,"ORG"],[25,44,"TIME"],[52,72,"MAJOR"],[78,84,"SCORE"],[85,91,"ORG"],[126,146,"TIME"],[212,258,"ORG"],[259,278,"TIME"],[279,290,"MAJOR"],[307,313,"SCORE"]]}
{"id":195,"text":"EDUCATION Bachelor | University of Science - VNU HCM � 2019 - Ongoing � Ho Chi Minh city • GPA: 8.94\/10","label":[[10,18,"DEGREE"],[21,52,"ORG"],[55,69,"TIME"],[96,103,"SCORE"]]}
{"id":196,"text":"EDUCATION FPT University 9\/2018 - present Final year student – Computer Science Nguyen Tat Thanh High School for the Gifted 09\/2015 - 05\/2018 Mathematics","label":[[10,24,"ORG"],[25,41,"TIME"],[63,79,"MAJOR"],[80,123,"ORG"],[124,141,"TIME"],[142,153,"MAJOR"]]}
{"id":197,"text":"Technical Experience \/\/ SCIENTIFIC RESEARCH SEP 2021 - Present Project: Development Of A Predictive Model For Time Series Using Deep Learning For Real Applications * Role: Project Investigator * Main works: Study the basic theories of predictive models used in deep learning. Research techniques of machine learning and deep learning for pre- processing of the dataset. Study techniques used to develop predictive models such as one-hot encoding, word embedding, Attention Mechanism, etc. Research neural networks in deep learning such as Multi-Layer Perceptron, Recurrent Neural Network, Long Short Term Memory, etc. * Recognition and Gains: The Call for paper for The 10th Science and Technology Symposium for OISP students 2021 (10th STS-OISP). ANDROID APPLICATION Jan - 2021 * Robot Controller App","label":[[44,62,"TIME"],[172,192,"POSITION"],[768,778,"TIME"]]}
{"id":198,"text":"Education \/\/ Major: Computer Engineering Aug 2019 - Present Ho Chi Minh City University Of Technology - Vietnam National University GPA: 7.4\/10","label":[[20,40,"MAJOR"],[41,59,"TIME"],[60,131,"ORG"],[137,143,"SCORE"]]}
{"id":199,"text":"EDUCATION Computer Science | VNU HCM University of Technology � August 2019 – Present � Ho Chi Minh City, VietNam • Overall GPA: 8.51, Digital Systems: 10.00, Calculus 2: 9.00","label":[[10,26,"MAJOR"],[29,61,"ORG"],[64,85,"TIME"],[129,133,"SCORE"]]}
{"id":200,"text":"Experience Apr 2021 - Present Research Student, Data Science Laboratory Research fields: Continual learning, Natural Language Processing � Gained knowledge: Machine Learning, Deep Learning, Mathematics, Probabilistic Graphical Models, Variational � Inference, Natural Language Process � Programming languages: Python","label":[[11,29,"TIME"],[30,46,"POSITION"],[48,71,"ORG"]]}
{"id":201,"text":"Education Sep 2019 - Present Hanoi University of Science and Technology - HUST, Computer Science, CPA: 3.53 \/ 4.0 Sep 2016 - May 2019 Hung Vuong High School for Gifted Students, Phu Tho Province, Specialize in Mathematics, CPA: 8.7 \/ 10.0","label":[[10,28,"TIME"],[29,78,"ORG"],[80,96,"MAJOR"],[103,113,"SCORE"],[114,133,"TIME"],[134,176,"ORG"],[210,221,"MAJOR"],[228,238,"SCORE"]]}
{"id":202,"text":" EXPERIENCE TMA Innovation -> 09\/2021 – present HO CHI MINH CITY \/\/\/ AI ENGINNER- PART TIME Survey Deepstream and Gstreamer, implement to AI projects. Investigate model for people counting project TMA Innovation -> 04\/2021 – 07\/2021 HO CHI MINH CITY \/\/\/ AI INTERNSHIP Research and work on Computer Vision in projects: Test and evaluate Plate License problem with Yolov5 Work on Detect Vehicle and OCR Number Symbol Project. Research, custom PaddleOCR and config for training to suitable for this project. Develop project flow . Can label and custom training detection with Yolov5. Be able to install deepstream and config to run for project (basic building). Work on Document OCR project. Using basic Docker.","label":[[13,27,"ORG"],[31,48,"TIME"],[70,81,"POSITION"],[198,212,"ORG"],[216,233,"TIME"],[255,268,"POSITION"]]}
{"id":203,"text":" EDUCATION HO CHI MINH CITY UNIVERSITY OF TECHNOLOGY AND EDUCATION -> 2018 – 2022 SOFTWARE TECHNOLOGY Final year student - GPA: 3.3\/4","label":[[12,67,"ORG"],[71,82,"TIME"],[83,102,"MAJOR"],[129,134,"SCORE"]]}
{"id":204,"text":"EDUCATION Aug 2018 - Now Ha Noi university of science and technology Major: Control Engineering and Automation GPA: 3.0","label":[[10,24,"TIME"],[25,68,"ORG"],[76,110,"MAJOR"],[116,119,"SCORE"]]}
{"id":205,"text":"RESEARCH EXPERIENCE Software Engineering Laboratory 2020 - Present Lab Assistant University of Science · SHREC2021-3D Shape Retrieval Challenge. • Surface-based protein domains retrieval. Solve retrieve similar protein surfaces problem with GNNs, A deep leaning-based method that operate on the generalized graph domain rather than on Eu- clidean domains like sequences and grids. • Retrieval and classiﬁcation of protein surfaces equipped with physical and chemical properties. Solve problem retrieval and classiﬁcation of protein surfaces on the basis of their geometry and physico- chemical properties by using GNNs. · Object Detection • Collect datasets and implement a neural network approach, which is suitable for deployment on an embedded systems such as cameras.","label":[[20,51,"ORG"],[52,66,"TIME"],[67,80,"POSITION"]]}
{"id":206,"text":"EDUCATION University of Science 2019-2023 Faculty of Information Technology Advanced Program in Computer Science Tay Ninh High School 2016-2019","label":[[10,31,"ORG"],[32,41,"TIME"],[96,112,"MAJOR"],[113,133,"ORG"],[134,143,"TIME"]]}
{"id":207,"text":"WORK EXPERIENCE NLP researcher Wisdom Robotics Inc. | August 2021 - December 2021 - Study and implement basic NLP algorithms such as edit distance, cosine similarity, tf-idf, word embeddings, etc... - Implement some basic architecture like RNN, LSTM, Transformer,... - Learn how to build a chatbot model pipeline. AI intern Online Office Inc. | October 2021 - January 2022 - Implement face recognition program to mark attendance and a simple OCR program. - Meeting customer to improve communication skill and understand the customers' needs.","label":[[16,30,"POSITION"],[31,51,"ORG"],[54,81,"TIME"],[314,323,"POSITION"],[324,342,"ORG"],[345,372,"TIME"]]}
{"id":208,"text":"ACADEMIC HISTORY FPT University BACHELOR OF ARTIFICIAL INTELLIGENCE, (2019 - PRESENT) GPA: 8.22 Tran Dai Nghia Highschool for the Gifted MATHEMATICS SPECIALIZATION (2017 - 2019)","label":[[17,31,"ORG"],[32,40,"DEGREE"],[44,67,"MAJOR"],[70,84,"TIME"],[91,95,"SCORE"],[96,136,"ORG"],[137,148,"MAJOR"],[165,176,"TIME"]]}
{"id":209,"text":"EDUCATION MAJOR: COMPUTER SCIENCE HANOI UNIVERSITY OF SCIENCE AND TECHNOLOGY 9\/2018 - 9\/2022 Sophomore","label":[[17,33,"MAJOR"],[34,76,"ORG"],[77,92,"TIME"]]}
{"id":210,"text":"Thông tin thêm Điền các thông tin khác (nếu có)","label":[]}
{"id":211,"text":"Hoạt động HIẾN MÁU NHÂN ĐẠO | 2017  -  2017 Tình nguyện viên - Hiến máu nhân đạo tại Đại học Công Đoàn THAM GIA ACM-ICPC CONTEST | 2019  -  2019 Thành viên của đội thứ 2 Đại Học Thủy Lợi - Thi vòng loại tại Học viện Công Nghệ Bưu Chính Viễn Thông","label":[]}
{"id":212,"text":"Education Biomedical Engineering International University | 2018 – 2022, Ho Chi Minh – Vietnam Mathematics, Machine Learning, Deep Learning, Big Data course University of Science | 09\/2020 – 01\/2021, Ho Chi Minh – Vietnam Applied Machine Learning University of Science | 04\/2020 – 04\/2021, Ho Chi Minh – Vietnam Studying end-to-end fundamental Machine Learning with 6 courses and 1 capstone project that is model to detect chest X-ray abnormalities. Data Science Math Skills course Coursera | 12\/2020 AI for Medical Diagnosis course Coursera | 12\/2020 Studying the CNN model like U-net and other AI-based method to facilitate the diagnosis and Pathology of diseases. Machine Learning Foundations Coursera | 09\/2020","label":[[10,32,"MAJOR"],[33,57,"ORG"],[60,71,"TIME"],[157,178,"ORG"],[181,198,"TIME"]]}
{"id":213,"text":"Experiences Machine learning engineer intern at AI-assisted Diagnostic System (A2DS) Ho Chi Minh | 06\/2021 - 10\/2021 Refactoring the optic macula and disc location project by Pytorch. Researching and building the optic macula and disc object detection by Detetron2 - Pytorch Teaching Assistant for AI for Healthcare course at International University Ho Chi Minh | 09\/2021 - now","label":[[12,44,"POSITION"],[48,84,"ORG"],[99,116,"TIME"],[275,293,"POSITION"],[326,362,"ORG"],[365,378,"TIME"]]}
{"id":214,"text":" Education Ho Chi Minh City University of Transport, Major: Electronics and Telecommunication 2017 - 2021 GPA: 2.61\/4","label":[[12,52,"ORG"],[61,94,"MAJOR"],[95,106,"TIME"],[112,118,"SCORE"]]}
{"id":215,"text":"Volunteering Experience Pest Identification System (Cycad Weevil) for Yun Hsiao at Australian National University | 02\/2022 – Present An image classification system that identifies whether a weevil is harmful for Australian cycad • ETL: Created a pipeline to import, process, and combine data from multiple sources. Applied data augmentation and identified suitable models for working with small amount of data. • Transfer Learning: Applied transfer learning by using ResNet-50 pre-trained on ImageNet and fine-tuning. Performed extensive hyperparameter tuning and reached a test accuracy of 100% with only 200 original images. • Model Deployment: Deployed the model onto a web application [web1, web2] for public access. • Agile Methodology: Communicated work frequently with domain expert for feedback.","label":[]}
{"id":216,"text":"Education Australian National University – Acton ACT | Bachelor of Information Technology Advanced Intelligent Systems, 08\/2020 - Expected completion in 12\/2023 • Completed coursework in Introductory Machine Learning, Regression Modelling, Relational Database with SQL, Computer Vision, Artificial Intelligence, Statistical Machine Learning, Neural Networks, Deep Learning and Bio- inspired Computing. • 3.37\/4 GPA. University of Sydney – Sydney NSW | Bachelor of Science Mathematics & Statistics, 02\/2019 –07\/2020 • Completed coursework in Calculus I, II, and III, Linear Algebra, Discrete Mathematics, Probability and Statistical Models, Introductory Programming with Python, Foundations of Data Science with R, Object-Oriented Programming with Java, Data Structures & Algorithms, and Data Informatics. • The Vice Chancellor's International Scholarships 2019 Recipient. University of Sydney Foundation Program – Sydney NSW 04\/2017 – 12\/2017 • 9.1\/10 GPA. Lawrence S.Ting School – Ho Chi Minh City Vietnam | High School Diploma 12\/2016 • Lawrence S.Ting School Entrance Scholarship 2014 Recipient.","label":[[10,52,"ORG"],[55,63,"DEGREE"],[67,89,"MAJOR"],[120,160,"TIME"],[404,410,"SCORE"],[416,449,"ORG"],[452,460,"DEGREE"],[472,496,"MAJOR"],[498,514,"TIME"],[872,924,"ORG"],[925,942,"TIME"],[945,951,"SCORE"],[957,980,"ORG"],[1029,1036,"TIME"]]}
{"id":217,"text":"Work experience Smart City 07\/2021 - Now Nova Intechs Building models for smart cities, some applications are detect: Detect Personal Protective Equipment at work space, car crash accident, human mask,... For applying multi-functions models in system, we design multi-task model based on Hydranet architecture. AMR 03\/2021 - 07\/2021 FPT Software As project name, AMR - Autonomous Mobile Robot, the goal in this phase is build a autonomous move package inside factories. In this project, my responsibility is build LIDAR to build map, localization, detect human, objects. VIP2020 12\/2020 - 03\/2021 FPT Software Project target is a model can detect vehicles and their types on roads in Japan, the speed of the vehicle and also tracking vehicles throgh camera. My role is collect data to make a huge dataset and tuning model for best accuracy, for every condition of weather like sunny, snow, night, rain,... 3DLabelTool 10\/2020 - 12\/2020 FPT Software The goal of this project is build an web application tool for annotation objects in 3d space. In this project, we build a web app with Flask and Python on server, an could process hundreds of people work at the same time. Tool can view, zoom, draw or do anything in space show up on web and save the information back to server. FURUNO 07\/2020 - 10\/2020 FPT Software FURUNO target is 2 points. First, they want to make a full data set with any conditions possible: sunny, rain, foggy, snow, etc, in every time in the day. My work in this project is analysis data, and have the result about the weather, image quality, etc aﬀect to the accuracy of model. Also, I deﬁne the model architect to detect object in the ocean. Raster to Vector 05\/2020 - 07\/2020 FPT Software Customer want an AI system can scan the hand-draw technical drawings and transfer them to CAD. My work is build a model to detect arrow, symbols to redraw in CAD. The hard thing here is deal with very less data, and very imbalance between symbols.","label":[[27,40,"TIME"],[41,53,"ORG"],[315,332,"TIME"],[333,345,"ORG"],[579,596,"TIME"],[597,609,"ORG"],[918,935,"TIME"],[936,948,"ORG"],[1284,1301,"TIME"],[1302,1314,"ORG"],[1684,1701,"TIME"],[1702,1714,"ORG"]]}
{"id":218,"text":"EDUCATION 2015 - 2018 2020 - 2021 Le Quy Don Machine Learning Engineer Nanodegree Highschool for the gifted CS229: Machine Learning 2018 - 2021 2020 - 2021 Bach Khoa University Deep Learning Nanodegree CS230: Deep Learning","label":[[10,21,"TIME"],[22,33,"TIME"],[34,44,"ORG"],[132,143,"TIME"],[144,155,"TIME"],[156,176,"ORG"]]}
{"id":219,"text":"EXPERIENCE UI\/UX DESIGNER 2018-2019 Mostly making banner, outsource design for custom- er provided by the company Stdio.vn GAME DEVELOPER FRESHER 2019 - 2020 Attemp for a fresher position of game developer at the company and working for a small game project of the Wolfun company using Unity Framework MACHINE LEARNING & DATA ANALYSIS 2020 - 2021 Get involve into the project of diagnosing depression of each document, paragraph, or even a person Self Study based on their comments. Learn some new stuﬀs with NLP and Model Training techniques. 2020 - 2021 DEEP LEARNING & BIG DATA Self Study Research on DL applications for credit scoring. Famil- iar working with Tensorﬂow and Pytorch for creating model architecture. Apply DL methods and Big data analysis for NLP tasks.","label":[[11,25,"POSITION"],[26,35,"TIME"],[123,145,"POSITION"],[146,157,"TIME"],[302,334,"POSITION"],[335,346,"TIME"],[544,555,"TIME"]]}
{"id":220,"text":"Kinh nghiệm làm việc Số hóa tủ sách 12\/2021-02\/2022 Đồ án học phần - Link github:  https:\/\/github.com\/Quang-Dobe\/CS114.M1x--- MachineLearning\/tree\/main\/%C4%90%E1%BB%93%20%C3%A1n - Số lượng thành viên: 03 - Ngôn ngữ lập trình: Python 3 - Mô tả chức năng: Lấy thông tin tên sách, tên tác giả, nhà xuất bản từ ảnh chụp bìa sách Game Caro 11\/2021-12\/2021 Đồ án học phần - Link github:  https:\/\/github.com\/Quang-Dobe\/CS511.M11 - Số lượng thành viên: 02 - Ngôn ngữ lập trình: C# (Windows Forms) - Mô tả chức năng: + Đánh với máy + 2 người chơi đánh với nhau qua LAN","label":[]}
{"id":221,"text":"Hoạt động Chào đón tân sinh viên 09\/2020-09\/2020 Hoạt động trường tổ chức - Hướng dẫn tân sinh viên tham gia Ngày chào đón Tân sinh viên do trường tổ chức. Chia sẻ kinh nghiệm, kiến thức, kỹ năng trong môi trường đại học Câu lạc bộ AI 09\/2020-09\/2020 Câu lạc bộ học thuật trong trường - Tham gia câu lạc bộ. Học hỏi, tìm hiểu các kiến thức được chia sẻ trên câu lạc bộ","label":[]}
{"id":222,"text":"Học vấn Đại học Công nghệ Thông tin 10\/2019-Hiện tại Ngành Khoa học máy tính Sinh viên năm 3 - GPA: 8.0","label":[]}
{"id":223,"text":"Education Sep 2017 – July 2021 Hanoi University of Science and Technology (HUST) Engineer in Computer Science • Thesis topic: A New Multitasking Evolutionary Algorithm with Self-parameter Adaptation for Many Tasks Optimization • GPA: 3.61\/4.0 • Thesis: 9.8\/10.0","label":[[10,30,"TIME"],[31,80,"ORG"],[93,109,"MAJOR"],[234,242,"SCORE"],[253,261,"SCORE"]]}
{"id":224,"text":"EDUCATION Hanoi University of Engineering and 2019-2023 Technology Major: Computer Engineering, GPA: 2.92 • • Descriptions: My major has to study more hardware and not many subjects related to AI, all the knowledge and projects are self-researched and researched because I am very interested in this field of artificial intelligence. • Certificates: UET Hackathon- Data scientist (2022)","label":[[10,41,"ORG"],[46,55,"TIME"],[74,94,"MAJOR"],[101,105,"SCORE"]]}
{"id":225,"text":"Personal MC-OCR 2\/2022 – Now GitHub: tqphu27\/MC-OCR (github.com) • • Descriptions: It can detect and extract information ( key information extraction). The problem is divided into 5 parts: eda, text detection, correct rotation, text classification and extraction. • Tech stack: Python, Pytourch, Opencv. Personal Other 2021-2022 I have some mini project: Titanic(Kaggle), cat-dog classification, Chest X-ray Abnormalities • Detection, and some small problem on Kaggle.","label":[[16,28,"TIME"],[319,328,"TIME"]]}
{"id":226,"text":"EXPERIENCE Intern AI Grooo International 4\/2022-6\/2022 • Processing data: Data labelling, training a model that can automatically rotate the correct image,… • Read paper and learned some new method: spade, craft.","label":[[11,17,"POSITION"],[18,40,"ORG"],[41,54,"TIME"]]}
{"id":227,"text":"Experience 12\/2014- 04\/2015 Undergraduate Researcher of Natural Language Processing Researching Group, UIT, VietNam, supervised by Dr. Ngan Nguyen. � Researched methodologies and applied NLP state-of-arts for Vietnamese domain. 12\/2017- 05\/2018 Undergraduated Research Assistant in Mathematics, Wichita State University, Kansas, supervised by Professor Saman Sahraei. � Studied set of speciﬁc diﬀerential equation problems called Burgers’ equations (inviscid equation and viscous equation) appearing in shocking waves and heat-involving phenomenon. � Published paper “Introduction to Burgers’ equation”. 05\/2019- 02\/2020 Main developer of Automatic Self-driving Indoor Vehicle Project, Wichita State University, Kansas, supervised by Dr. Hongsheng He. � Researched general framework for automatic self-driving vehicle. � Worked with mobile robot Husky with LIDAR sensor and Realsense camera. � Developed Human-Detection algorithm. � Developed Ground-Plane algorithm. � Worked with SLAM problem, and indoor mobile planning. � Developed State-machine Reactive System","label":[[11,27,"TIME"],[42,52,"POSITION"],[56,106,"ORG"],[228,244,"TIME"],[260,278,"POSITION"],[295,327,"ORG"],[604,620,"TIME"],[626,635,"POSITION"],[686,718,"ORG"]]}
{"id":228,"text":"Education 2014–2015 Undegraduate, University of Information Technology (UIT), VietNam. Studying Computer Science in honor program. Valedictorian in 2014 (Rank 1st in Entrance Exam). Total scholarship for 2014–2017. Undegraduate, 2017–Now Wichita State University, Wichita, Kansas. Junior in Computer Science Major program with Math Minor.","label":[[10,19,"TIME"],[34,76,"ORG"],[96,112,"MAJOR"],[204,213,"TIME"],[229,237,"TIME"],[238,287,"ORG"],[291,307,"MAJOR"]]}
{"id":229,"text":"P R O J E C T P A R T I C I P A T I O N Vehicle Tracking and Counting (Personal project) Description: Use YOLO to detect the vehicle and tracking using deep SORT then count the vehicle when passing the line. The technology used: YOLOv3, Deep Sort, Tensorflow Exp: knowledge about object detection and object tracking Link project: https:\/\/github.com\/datng-dev\/Vehicle-Counting Output Video: https:\/\/www.youtube.com\/watch? v=lCslHWpeqt8 Face MaskDetection(Personal project) Description: Build a model to recognize a face wear mask The technology used: Keras, OpenCV Exp: knowledge about CNN, data processing Link project: https:\/\/github.com\/datng-dev\/FaceMaskDetection","label":[]}
{"id":230,"text":"E X P E R I E N C E Internship at | 1\/2021 - 4\/2021 FPT Software Da Nang","label":[[20,30,"POSITION"],[36,51,"TIME"],[52,72,"ORG"]]}
{"id":231,"text":"E D U C A T I O N FPT University | August 2018 - Present Major: Software Engineering (IS). GPA: 8.39\/10 (3.35\/4)","label":[[18,32,"ORG"],[35,56,"TIME"],[64,84,"MAJOR"],[96,103,"SCORE"],[105,111,"SCORE"]]}
{"id":232,"text":"EXPERIENCES ▪ ZENT Education and Technology Group Hanoi, Vietnam AI Intern April 2020 – Match 2020 Focus on Computer Vision: - Apply Machine Learning, Deep Learning in practical problems. - Programming Language: Python. ▪ FTECH CO., LTD Hanoi, Vietnam AI Intern April 2021 – Present Focus on Computer Vision: - Apply Machine Learning, Deep Learning in practical problems. - Programming Language: Python.","label":[[14,49,"ORG"],[65,74,"POSITION"],[75,98,"TIME"],[108,123,"MAJOR"],[222,236,"ORG"],[252,261,"POSITION"],[262,282,"TIME"],[292,307,"MAJOR"]]}
{"id":233,"text":"EDUCATION ▪ Ha Noi University of Science and Technology Hanoi, Vietnam Talented Program of Applied Mathematics and Informatics August 2018 - Present ▪ Nghi Son High School Thanh Hoa, Vietnam 2015 - 2018","label":[[12,70,"ORG"],[91,126,"MAJOR"],[127,148,"TIME"],[151,190,"ORG"],[191,202,"TIME"]]}
